{
  "id": "kenya-information-communications-act",
  "type": "statute",
  "title": "Kenya Information and Communications Act",
  "title_en": "Kenya Information and Communications Act",
  "short_name": "KICA",
  "status": "in_force",
  "issued_date": "1998-01-01",
  "in_force_date": "1998-01-01",
  "url": "https://new.kenyalaw.org/akn/ke/act/1998/2/",
  "description": "Regulates telecommunications and ICT sector; establishes the Communications Authority of Kenya",
  "provisions": [
    {
      "provision_ref": "s1",
      "chapter": "Part I",
      "section": "1",
      "title": "Short title",
      "content": "This Act may be cited as the Kenya Information and Communications Act. [Act No. 1 of 2009 , s. 3.]"
    },
    {
      "provision_ref": "s2",
      "chapter": "Part I",
      "section": "2",
      "title": "Interpretation",
      "content": "(1) In this Act unless, the context otherwise requires— \"access\" in relation to any computer system, means instruct, communicate with, store data in, retrieve data from, or otherwise make use of any of the resources of the computer system; \"act of vandalism\" means any willful, negligent, reckless or malicious act of stealing, destroying, damaging or breaking into telecommunications apparatus, lines, installations, hardware, software or plant used for telecommunication services and systems; \"advanced electronic signature\" means an electronic signature which meets all the following requirements— (a) is uniquely linked to the signatory; (b) is capable of identifying the signatory: (c) it is created using means that the signatory can maintain under his sole control; and (d) it is linked to the data to which it relates in such a manner that any subsequent change to the data is detectable; \"agreement\" includes decisions or practices; \"Authority\" means the Communications Authority of Kenya established under section 3 ; “Board” means the Board of Directors constituted under section 6 ; \"broadcaster\" means any legal or natural person who composes or packages distributes television or radio programm services for reception by the public or sections of the public or subscribers to such a service, irrespective of technology used; \"broadcasting\" means unidirectional conveyance of sounds or television programmes, whether encrypted or not by radio or other means of telecommunications, for reception by the public; \"broadcasting service\" means any service which consists of the broadcasting of television or sound broadcasting programs to the public, sections of the public or subscribers to such a service; \"broadcasting signal distribution\" means the process whereby the output signal of a broadcasting service is taken from the point of origin, being the point where such signal is made available in its final content format, from where it is conveyed to any broadcast target area by means of a telecommunication process and includes multi-channel distribution; \"Cabinet Secretary\" means the Cabinet Secretary for the time being responsible for information, communication and technology; \"certificate\" means a record which is issued by a certification service provider for the purpose of supporting a digital signature which purports to confirm the identity or other significant characteristics of the person who holds a particular key pair; identifies the certification service provider issuing it; names or identifies the person to whom it is issued; contains the public key of the person to whom it is issued; and is signed by a responsible officer of the certification service provider issuing it; \"certification service provider\" means a person who has been granted a licence to issue a digital signature certificate; “Commission” means the Communications Authority of Kenya; \"community\" includes a geographically founded community or any group of persons or sector of the public having a specific, ascertainable common interest; \"community broadcasting service\" means a broadcasting service which meets all the following requirements— (a) is fully controlled by a non-profit entity and carried on for nonprofitable purposes; (b) serves a particular community; (c) encourages members of the community served by it or persons associated with or promoting the interests of such community to participate in the selection and provision of programmes to be broadcast in the course of such broadcasting service; and (d) may be funded by donations, grants, sponsorships or membership fees, or by any combination of the aforementioned; \"computer\" means any electronic, magnetic, optical or other high-speed data processing device or system which performs logical, arithmetic and memory functions by manipulations of electronic, magnetic or optical impulses, and includes all input, output, processing, storage, software and communication facilities which are connected or related as a system or network; \"computer service\" includes data processing and the storage or retrieval of data; \"computer system\" means a device or collection of devices including input and output devices but excluding calculators which are not programmable and capable of being used in conjunction with external files which contain computer programmes, electronic instructions and data that perform logic, arithmetic, data storage, data retrieval, communication control and other functions; \"country code top-level domain\" means top-level domain .ke used and reserved for Kenya; “courier services” means any specialised service for the collection, despatch, conveyance, handling and delivery of postal articles; “customs law” means any law relating to the collection of customs duties or transfer tax; \"cyber security\" means the collection of tools, policies, security concepts, security safeguards, guidelines, risk management approaches, actions, training, best practices, assurance and technologies that can be used to protect the cyber environment; \"data\" means information recorded in a format in which it can be processed by equipment operating automatically in response to instructions given for that purpose, and includes representations of facts, information and concepts held in any removable storage medium; “Director-General” means the Director-General of the Commission appointed under section 6 ; \"document of title\" means a formal document that is considered sufficient proof that the person who possesses it is entitled to receive, hold, and dispose of the instrument and the goods that it covers; \"dominant telecommunications service provider\" means a licensee determined to be a dominant telecommunications service provider pursuant to the criteria set out in sections 4 and 23 of the Competition Act ( Cap. 504 ); \"e-Government services\" means public services provided electronically by a Ministry or Government department, local authority, or any body established by or under any law or controlled or funded by the Government; \"electronic\" means relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities; \"electronic form\" with reference to information, means any information generated, sent, received or stored in magnetic, optical, computer memory, microfilm or similar device; \"electronic Gazette \" means the Kenya Gazette published in electronic form; \"electronic record\" means a record generated in digital form by an information system, which can be transmitted within an information system or from one information system to another and stored in an information system or other medium; \"electronic signature\" means data in electronic form affixed to or logically associated with other electronic data which may be used to identify the signatory in relation to the data message and to indicate the signatory's approval of the information contained in the data message; \"encryption\" means a method transforming signals in a systematic way so that the signal would be unintelligible without a suitable receiving apparatus; \"equipment\" includes any appliance, apparatus or accessory used or intended to be used for communication services; \"former Commission\" means the Communications Commission of Kenya immediately existing before the commencement of this Act; \"free-to-air service\" means a service which is broadcast without encryption and capable of being received by conventional broadcasting receiving apparatus; “financial year” means a financial year within the meaning of section 18 ; “franking machine” means a machine for the purpose of making impressions on postal articles to denote pre-payment of postage and includes any meter or meters and any franking or date-stamping die incidental thereto; \"function\" includes logic, control, arithmetic, deletion, storage and retrieval and communication or telecommunication to from or within a computer system; \"Fund\" means the Universal Service Fund established by section 84J of this Act; \"information and communication technologies\" means technologies employed in collecting, storing, using or sending out information and include those involving the use of computers or any telecommunication system; “installation or plant used for posts” includes all buildings, lands, structures, machinery, equipment, boxes and receptacles used or intended for use in connection with the transmission of postal articles by post; \"intercept\" in relation to a function of a computer, includes listening to, or recording a function of a computer, or acquiring the substance, its meaning or purport of such function; \"Kenyan programme\" means sounds or vision or a combination of both whose content comply with the classification of local content as may be required by the Commission from time to time; “letter” means any written or printed communication conveying from one person to another particular information upon matters personal to such persons or information upon which it is intended that the recipient should reply, act or refrain from acting, but does not include any written or printed communication which is a newspaper or a periodical accompanied by any other communication; \"licence\" means any licence issued under this Act; “mail bag” means any bag, container, envelope or covering in which postal articles are conveyed; \"market\" means a market in Kenya or a substantial part of Kenya and refers to the range of reasonable possibilities for substitution in supply or demand between particular kinds of goods or services and between suppliers or acquirers, or potential suppliers or acquirers, of those goods or services; \"media\" means broadcast, electronic and other types of media but does not include print and book publishing; \"Media Council\" means the Media Council of Kenya established under the Media Council Act ( Cap. 411B ); \"modification\" means a modification of the contents of any computer system by the operation of any function of that computer system or any other computer system as a result of which- (a) any program or data held in the computer system is altered or erased; (b) any program or data is added to its contents; or (c) any act occurs which impairs the normal operation of the computer system; “parcel” means a postal article which is posted at the office of a licensee as a parcel or is received at another office: Provided that the said parcel is not smaller than the minimum size or heavier than the maximum weight prescribed; \"password\" means any data by which a computer service or a computer system is capable of being obtained or used; \"possession\", \"be in possession of\" and \"have in possession\" have the meanings assigned to such expressions in section 4 of the Penal Code ( Cap. 63 ); “post”— (i) when used with reference to telecommunication includes any pole, standard, stay, strut or other above-ground contrivance for installing, carrying, supporting or suspending a telecommunication line; and (ii) when used with reference to the transmission of postal articles by post, means any system for the collection, despatch, conveyance, handling and delivery of postal articles; “post office” means any building, house, room, receptacle, vessel, vehicle or place where postal articles are received, delivered, sorted, made up or despatched; “postage” means the fee chargeable for the transmission by post of postal articles; “postage stamp” means any label or stamp for denoting any postage or other sum payable in respect of a postal article, and includes an adhesive postage stamp or a stamp printed, impressed or otherwise indicated on a postal article, whether issued by the Government of Kenya or any other country; “postal article” means any article or thing transmissible by post, including but not limited to letters, aerogrammes, postcards and parcels but does include such article or thing as the Commission determines not to be transmissible by post; “postal service” means any service by post; “postcard” means a card recognised"
    },
    {
      "provision_ref": "s3",
      "chapter": "Part II",
      "section": "3",
      "title": "Establishment of Commission",
      "content": "(1) There is hereby established a Commission to be known as the Communications Authority of Kenya. (2) The Commission shall be a body corporate with perpetual succession and a common seal and shall, in its corporate name, be capable of— (a) suing and being sued; (b) taking, purchasing or otherwise acquiring, holding, charging and disposing of movable and immovable property; (c) borrowing or lending money; and (d) doing or performing all such other things or acts for the proper performance of its functions under this Act which may be lawfully done or performed by a body corporate. [Act No. 41A of 2013 , s. 3.]"
    },
    {
      "provision_ref": "s4",
      "chapter": "Part II",
      "section": "4",
      "title": "Headquarters",
      "content": "The Headquarters of the Commission shall be in Nairobi."
    },
    {
      "provision_ref": "s5",
      "chapter": "Part II",
      "section": "5",
      "title": "Object and purpose of the Commission",
      "content": "(1) The object and purpose for which the Commission is established shall be to licence and regulate postal, information and communication services in accordance with the provisions of this Act. (2) The Commission shall have all powers necessary for the performance of its functions under this Act. (3) The Commission may enter into association with such other bodies or organisations within or outside Kenya as the Commission may consider desirable or appropriate and in furtherance of the purpose for which the Commission is established. (4) The Commission shall, in the performance of its functions under this Act have regard to— (a) any policy guidelines of a general nature relating to the provisions of this Act notified to it by the Cabinet Secretary and published in the Gazette ; (b) Kenya’s obligations under any international treaty or agreement relating to the provisions of telecommunication, radio and postal services. (5) Deleted by Act No. 1 of 2009 , s. 5(b). [Act No. 1 of 2009 , s. 5.]"
    },
    {
      "provision_ref": "s5A",
      "chapter": "Part II",
      "section": "5A",
      "title": "Independence of the Authority",
      "content": "(1) The Authority shall be independent and free of control by government, political or commercial interests in the exercise of its powers and in the performance of its functions. (2) In fulfilling its mandate, the Authority shall be guided by the national values and principles of governance in Article 10 and the values and principles of public service in Article 232(1) of the Constitution. [Act No. 1 of 2009 , s. 6, Act No. 41A of 2013 , s. 4.]"
    },
    {
      "provision_ref": "s5B",
      "chapter": "Part II",
      "section": "5B",
      "title": "Freedom of the Media",
      "content": "(1) The Authority shall, in undertaking its functions under this Act comply with the provisions of Article 34(1) and (2) of the Constitution. (2) Subject to Article 24 of the Constitution, the right to freedom of the media and freedom of expression may be limited for the purposes, in the manner and to the extent set out in this Act and any other written law. (3) A limitation of a freedom under subsection (2) shall be limited only to the extent that the limitation is reasonable and justifiable in an open and democratic society based on human dignity, equality and freedom. (4) The right to freedom of expression shall not extend to— (a) the spread of propaganda for war; (b) incitement to violence; (c) the spread of hate speech; or (d) advocacy of hatred that— (i) constitutes ethnic incitement, vilification of others persons or community or incitement to cause harm; or (ii) is based on any ground of discrimination specified or contemplated in Article 27(4). (5) The Cabinet Secretary, in consultation with the Authority may make regulations for the better carrying out of the provisions of this section. [Act No. 1 of 2009 , s. 6, Act No. 41A of 2013 ,s. 5, Act No. 25 of 2015 , Sch.]"
    },
    {
      "provision_ref": "s5C",
      "chapter": "Part II",
      "section": "5C",
      "title": "Policy guideleines by the Cabinet Secretary",
      "content": "(1) The Cabinet Secretary may issue to the Authority, policy guidelines of a general nature relating to the provisions of this Act. (2) The guidelines referred to under subsection (1) shall be in writing and shall be published in the Gazette . [Act No. 41A of 2013 , s. 5.]"
    },
    {
      "provision_ref": "s6",
      "chapter": "Part II",
      "section": "6",
      "title": "Board of Authority",
      "content": "(1) The management of the Authority shall vest on the Board which shall consist of— (a) a chairperson appointed by the President; (b) the Principal Secretary for the time being responsible for matters relating to broadcast, electronic, print and all other types of media; (c) the Principal Secretary for the time being responsible for matters relating to finance; (d) the Principal Secretary for the time being responsible for matters relating to internal security; and (e) seven persons appointed by the Cabinet Secretary. (2) In appointing the members of the Board under subsection (1)(e), the Cabinet Secretary shall ensure- (a) that the appointees to the Board reflect the interests of all sections of society; (b) equal opportunities for persons with disabilities and other marginalised groups; and (c) that not more than two-thirds of the members are of the same gender. [Act No. 1 of 2009 , s. 7, Act No. 41A of 2013 , s. 6, Act No. 18 of 2018 , Sch.]"
    },
    {
      "provision_ref": "s6A",
      "chapter": "Part II",
      "section": "6A",
      "title": "Qualifications for appointment of chairperson and members of the Board",
      "content": "(1) A person shall be qualified for appointment as a chairperson or member of the Board under subsection (1)(a) and (e), if that person is— (a) a citizen of Kenya; (b) holds a degree from a university recognized in Kenya, in any of the following fields— (i) law; (ii) telecommunications, information and communication technology; (iii) broadcasting; (iv) postal regulation; (v) humanities and social sciences; or (vi) any other relevant field. (c) has experience in the relevant sector for a period of at least ten years in the case of the chairperson and five years in the case of any other member; and (d) satisfies the requirements of Chapter Six of the Constitution. (2) Despite subsection (1)(b) and (c), a person may be qualified for appointment as a chairperson or member of the Board, if such person, not being a degree holder, demonstrates that he or she has a distinguished career of not less than twenty years in the information, communication and technology sector. (3) A person shall not be qualified for appointment as a chairperson or member of the Board under section 6 (1)(a) and (e) if that person— (a) in the last six months immediately preceding the appointment, had personal direct or indirect commercial interest in the sector regulated under this Act; (b) is an office-bearer or employee of any political party; (c) is a public officer; (d) is an undischarged bankrupt; (e) suffers from physical or mental infirmity that would render him or her incapable of discharging the functions of the Board; (f) has been convicted of a felony and sentenced to a term of imprisonment; (g) has been convicted of an offence under this Act; or (h) has been compelled to resign or been removed from office, on account of abuse of office. [Act No. 41A of 2013 , s. 7.]"
    },
    {
      "provision_ref": "s6C",
      "chapter": "Part II",
      "section": "6C",
      "title": "Term of office",
      "content": "The chairperson and members of the Board shall hold office for a period of three years renewable once. [Act No. 41A of 2013 , s. 7.]"
    },
    {
      "provision_ref": "s6D",
      "chapter": "Part II",
      "section": "6D",
      "title": "Vacation from office",
      "content": "(1) The office of the chairperson or member shall become vacant if the holder— (a) resigns from office by notice in writing to the Cabinet Secretary; (b) dies; (c) is removed from office for— (i) gross misconduct, whether in the performance of the chairperson or member's functions or otherwise; or (ii) is absent from three consecutive meetings of the Authority without permission of the Board, except for good cause shown. (2) A person desiring the removal of a member of the Board of the Authority on the grounds specified in subsection (1)(c) may present a complaint under oath to the Cabinet Secretary, setting out the alleged facts constituting that ground. (3) The Cabinet Secretary shall consider the complaint and, if satisfied that it discloses a ground under subsection (1)(c), shall send the complaint to the President. (4) On considering a complaint under subsection (1), or on receiving a complaint under subsection (3), the President— (a) may suspend the chairperson or member pending the outcome of the complaint; and (b) shall appoint a tribunal in accordance with subsection (5). (5) The tribunal appointed under subsection (4)(b) shall consist of— (a) a person who holds or has held office as a Judge of a superior court, who shall be the chairperson; (b) at least two persons who are qualified to be appointed as Judges of the High Court; and (c) one other member who is qualified to assess the facts in respect of the particular ground for removal. (6) The tribunal shall investigate the matter expeditiously, report on the facts and make a recommendation to the President, who shall act in accordance with the recommendation within thirty days. (7) The procedure for removal of the chairperson or a member under section 6D shall be carried out in accordance with Article 47 of the Constitution on fair administrative justice. [Act No. 41A of 2013 , s. 7.]"
    },
    {
      "provision_ref": "s7",
      "chapter": "Part II",
      "section": "7",
      "title": "Powers of the Board",
      "content": "The Board shall have all the powers necessary for the performance of the functions of the Commission under this Act and in particular, but without prejudice to the generality of the foregoing, the Board shall have power to— (a) manage, control and administer the assets of the Commission in such manner and for such purposes as best promote the purposes for which the Commission is established; (b) receive any gifts, grants, donations or endowments made to the Commission or any other monies in respect of the Commission and make disbursements therefrom in accordance with the provisions of this Act; (c) determine the provisions to be made for capital and recurrent expenditure and for reserves of the Commission; (d) open a banking account or banking accounts for the funds of the Commission; (e) invest any monies of the Commission not immediately required for the purposes of this Act in the manner provided in section 21 ; (f) establish a broadcasting standards committee and such other committees as may be necessary to carry out its functions; and (g) co-opt persons whose skills and expertise may be necessary for the functions of the Authority: Provided that any person co-opted in the Authority may attend the meetings of the Authority and participate in its deliberations, but shall have no power to vote. [Act No. 41A of 2013 , s. 8.]"
    },
    {
      "provision_ref": "s8",
      "chapter": "Part II",
      "section": "8",
      "title": "Conduct of business and affairs of the Board",
      "content": "The conduct and regulation of the business and affairs of the Board shall be as provided in the First Schedule, but subject thereto, the Board may regulate its own procedure."
    },
    {
      "provision_ref": "s9",
      "chapter": "Part II",
      "section": "9",
      "title": "Delegation by the Board",
      "content": "The Board may, by resolution either generally or in any particular case, delegate to any committee of the Board or to any member, officer, employee or agent of the Commission the exercise of any of the powers or the performance of any of the functions or duties of the Board under this Act."
    },
    {
      "provision_ref": "s10",
      "chapter": "Part II",
      "section": "10",
      "title": "Remuneration of Board members",
      "content": "The Board, in consultation with the Cabinet Secretary, shall pay to members of the Board such remuneration, fees or allowances for expenses as it may determine."
    },
    {
      "provision_ref": "s11",
      "chapter": "Part II",
      "section": "11",
      "title": "The Director-General",
      "content": "(1) The Director-General shall be the chief executive officer of the Authority and shall be responsible for the day to the day management of the Authority. (2) The Director-General shall be an ex officio member of the Board but shall have no right to vote at any meeting of the Board. (3) The Director-General shall be recruited and appointed by the Board through a competitive process. (4) The Board shall determine the terms and conditions of service of the Director-General, in consultation with the Public Service Commission. (5) The Director-General shall be appointed for a term of four years renewable once. [Act No. 41A of 2013 , s. 9.]"
    },
    {
      "provision_ref": "s13",
      "chapter": "Part II",
      "section": "13",
      "title": "Staff of the Commission",
      "content": "The Board may appoint such officers or servants as are necessary for the proper discharge of the functions of the Commission under this Act or any other written law, upon such terms and conditions of service as the Board may determine."
    },
    {
      "provision_ref": "s14",
      "chapter": "Part II",
      "section": "14",
      "title": "The common seal of the Commission",
      "content": "(1) The common seal of the Commission shall be kept in such custody as the Board may direct and shall not be used except on the order of the Board. (2) The common seal of the Commission, when affixed to a document and duly authenticated, shall be judicially and officially noticed and unless and until the contrary is proved, any necessary order or authorisation by the Board under this section shall be presumed to have been duly given."
    },
    {
      "provision_ref": "s15",
      "chapter": "Part II",
      "section": "15",
      "title": "Protection from personal liability",
      "content": "Subject to section 16 , no matter or thing done by a member of the Board or by any officer, employee or agent of the Commission shall, if the matter or thing is done bona fide for executing the functions, powers or duties of the Commission under this Act, render the member, officer, employee or agent or any person acting on their directions personally liable to any action, claim or demand whatsoever."
    },
    {
      "provision_ref": "s16",
      "chapter": "Part II",
      "section": "16",
      "title": "Liability for damages",
      "content": "The provisions of section 15 shall not relieve the Commission of the liability to pay compensation or damages to any person for any injury to him, his property or any of his interests caused by the exercise of any power conferred by this Act or any other written law or by the failure, whether wholly or partially, of any works."
    },
    {
      "provision_ref": "s17",
      "chapter": "Part II",
      "section": "17",
      "title": "Funds of the Commission",
      "content": "The funds of the Commission shall consist of— (a) such moneys or assets as may accrue to or vest in the Commission in the course of the exercise of its powers or the performance of its functions under this Act; (b) such sums as may be payable to the Commission pursuant to this Act or any other written law, or pursuant to any gift or trust; (c) such moneys as may be provided by Parliament for the purposes of the Commission; (d) all moneys from any other source provided for or donated or lent to the Commission."
    },
    {
      "provision_ref": "s18",
      "chapter": "Part II",
      "section": "18",
      "title": "Financial year",
      "content": "The financial year of the Commission shall be the period of twelve months ending on the thirtieth June in each year."
    },
    {
      "provision_ref": "s19",
      "chapter": "Part II",
      "section": "19",
      "title": "Annual estimates",
      "content": "(1) At least three months before the commencement of each financial year, the Board shall cause to be prepared estimates of the revenue and expenditure of the Commission for that year. (2) The annual estimates shall make provision for all estimated expenditure of the Commission for the financial year concerned, and in particular shall provide— (a) for the payment of the salaries, allowances and other charges in respect of the staff of the Commission and the members of the Board; (b) for the payment of the pensions, gratuities and other charges in respect of retirement benefits to staff of the Commission; (c) for the proper maintenance of the buildings and grounds of the Commission; (d) for the proper maintenance, repair and replacement of the equipment and other movable property of the Commission; (e) for the creation of such reserve funds to meet future or contingent liabilities in respect of retirement benefits, insurance or replacement of buildings or equipment or in respect of such other matters as the Board may deem fit; (f) for the payment of the salaries, allowances and other charges in respect of the staff of the National Communications Secretariat established under section 84 , and such other expenses of the Secretariat as may be approved by the Cabinet Secretary from time to time; and (g) for the payment of salaries, allowances and other charges in respect of the staff of the Tribunal and such other expenses of the Tribunal as may be approved by the Cabinet Secretary from time to time. (3) The annual estimates shall be submitted to the Board for approval before the commencement of the financial year to which they relate: Provided that once approved, the sum provided in the estimates shall not be increased without the prior consent of the Board. (4) No expenditure shall be incurred for the purposes of the Commission except in accordance with the annual estimates approved under subsection (3) or in pursuance of an authorisation of the Board."
    },
    {
      "provision_ref": "s20",
      "chapter": "Part II",
      "section": "20",
      "title": "Accounts and audit",
      "content": "(1) The Board shall cause to be kept all proper books and records of accounts of the income, expenditure, assets and liabilities of the Commission. (2) Within a period of three months after the end of each financial year, the Board shall submit to the Auditor-General or to an auditor appointed under subsection (3), the accounts of the Commission together with— (a) a statement of income and expenditure during that year; and (b) a statement of the assets and liabilities of the Commission on the last day of the financial year. (3) The accounts of the Commission shall be audited by the Auditor-General or by an auditor appointed by the Board with the written approval of the Auditor-General. (4) The appointment of an auditor shall not be terminated by the Board without the prior written consent of the Auditor-General. (5) The Auditor-General may give general or special directions to an auditor appointed under subsection (3) and the auditor shall comply with those directions. (6) An auditor appointed under subsection (3) shall report directly to the Auditor-General on any matter relating to the directions given under subsection (5) of this section. (7) Within a period of six months after the end of the financial year, the Auditor-General shall report on the examination and audit of the accounts of the Commission to the Board and to the Cabinet Secretary, and in the case of an auditor appointed under subsection (3), the auditor shall transmit a copy to the report to the Auditor-General. (8) Nothing in this Act shall be construed to prohibit the Auditor-General from carrying out an inspection of the Commission’s accounts or records whenever it appears to him desirable and the Auditor-General shall carry out such an inspection at least once every six months. (9) Notwithstanding anything in this Act, the Auditor-General may transmit to the Cabinet Secretary a special report on any matters incidental to his powers under this Act, and section 19(3) and (4) of the Exchequer and Audit Act ( Cap. 412 ) shall, mutatis mutandis , apply to any report made under this section. (10) The Cabinet Secretary shall lay the audit report before the National Assembly as soon as reasonably practicable after the report is submitted to him under this section. (11) The fee for any auditor, not being a public officer, shall be determined and paid by the Board."
    },
    {
      "provision_ref": "s21",
      "chapter": "Part II",
      "section": "21",
      "title": "Investment of funds",
      "content": "(1) The Board may invest any of the funds of the Commission which are not immediately required for its purposes in such securities as the National Treasury may, from time to time, approve. (2) The Board may place on deposit with such bank or banks as it may determine, any moneys not immediately required for the purposes of the Commission."
    },
    {
      "provision_ref": "s22",
      "chapter": "Part II",
      "section": "22",
      "title": "Annual report",
      "content": "(1) The Board shall, within three months after the end of each financial year, prepare and submit to the Cabinet Secretary a report of the operations of the Board for the immediately preceding year. (2) The Cabinet Secretary shall lay the annual report before the National Assembly within three months of the day the Assembly next sits after the report is presented to him. Part III – TELECOMMUNICATION SERVICES"
    },
    {
      "provision_ref": "s23",
      "chapter": "Part III",
      "section": "23",
      "title": "Provision of telecommunication services",
      "content": "(1) The Commission shall, so far as is reasonably practicable, ensure there are provided throughout Kenya, such telecommunication services and in particular, emergency, public payphone and directory information services, as are reasonably necessary to satisfy the public demand thereof. (2) Without prejudice to the generality of subsection (1), the Commission shall— (a) protect the interests of all users of telecommunication services in Kenya with respect to the prices charged for and the quality and variety of such services; (b) maintain and promote effective competition between persons engaged in commercial activities connected with telecommunication services in Kenya in order to ensure efficiency and economy in the provision of such services and to promote research and development in relation thereto; (c) encourage private investment in the telecommunication sector; (d) enable persons providing telecommunication services or producing telecommunication apparatus in Kenya to compete effectively in the provision of such services or apparatus outside Kenya; (e) have regard to the values and principles of the Constitution; (ee) ensure processing of personal data of subscribers is in accordance with principles set out under the Data Protection Act ( Cap. 411C ). [Act No. 41A of 2013 , s. 11, Act No. 24 of 2019 , 2nd Sch.]"
    },
    {
      "provision_ref": "s24",
      "chapter": "Part III",
      "section": "24",
      "title": "Requirement of licence",
      "content": "(1) No person shall— (a) operate a telecommunication system; or (b) provide any telecommunication services, except in accordance with a valid licence granted under this Act. (2) A person who contravenes any of the provisions of this section commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years, or to both. [Act No. 1 of 2009 , s. 8.]"
    },
    {
      "provision_ref": "s25",
      "chapter": "Part III",
      "section": "25",
      "title": "Telecommunication Licences",
      "content": "(1) The Commission may, upon application in the prescribed manner and subject to such conditions as it may deem necessary, grant licences under this section authorising all persons, whether of a specified class or any particular person to— (a) operate telecommunication systems; or (b) provide telecommunication services, of such description as may be specified in the licence. (2) A licence granted under subsection (2)(a) may authorise— (a) the provision, by means of any telecommunication system to which the licence relates, of any telecommunication services of a description specified in the licence; and (b) the connection to any telecommunication system to which the licence relates of— (i) any other telecommunication systems of a description specified in the licence; and (ii) any telecommunication apparatus of a description specified in the licence. (3) A licence granted under this section may include conditions requiring the licensee— (a) to provide the telecommunication services specified in the licence or of a description so specified; (b) to interconnect to the telecommunication system to which the licence relates, or to permit the connection to such system, of such other telecommunication systems and apparatus as are specified in the licence or are of a description so specified, either without charge or subject to a reasonable charge to be determined in accordance with the method specified in the licence; (c) to permit the provision by means of the telecommunication system or telecommunication apparatus connected thereto of such services as are specified or of a description so specified; (cc) to ensure necessary steps are taken to secure the integrity of personal data under their possession or control through the adoption of appropriate, reasonable, technical and organizational measures to prevent the loss of, damage to or unauthorized destruction and prevent any unlawful access to or unauthorized processing of personal data; (d) to pay such fees as the Commission may prescribe; and (e) to fulfil such other conditions as the Commission may prescribe. (3A) A licensee shall maintain a register of all persons to whom telecommunications services are provided under the licence, in such form as may be prescribed. (4) A licence granted under this section shall, unless earlier revoked in accordance with any term in that regard contained in the licence, continue in force for such period as may be specified in the licence. (5) The Commission may, renew, vary, modify or revoke any licence granted under this Act in accordance with the provisions of this Act. [Act No. 12 of 2012 , Sch., Act No. 24 of 2019 , 2nd Sch.]"
    },
    {
      "provision_ref": "s25A",
      "chapter": "Part III",
      "section": "25A",
      "title": "Payment of licence fees",
      "content": "(1) The Authority may prescribe fees payable for a licence issued under this Part. (2) Subject to subsection (3), an applicant shall pay the prescribed fees in full before the grant of a licence. (3) The Authority may permit the payment of spectrum license fees in equal instalments over a period not exceeding ten years if— (a) the fees exceed one billion shillings; (b) the applicant is a Kenyan citizen or an entity in which Kenyan citizens own at least fifty-one per cent shares; and (c) the applicant undertakes to construct at least five hundred base transceiver stations across the country within three years of the grant of the licence. (4) A person granted a licence subject to the conditions under subsection (3) shall be liable to pay the prescribed licence fee in full if they— (a) cease to be a Kenyan citizen or an entity in which Kenyan citizens own at least fifty-one per cent shares; or (b) propose a transfer or assignment of the licence to a non-citizen or an entity in which Kenyan citizens do not own at least fifty-one per cent shares. (5) The Authority shall revoke a licence granted subject to the conditions under subsection (3) if the licensee fails to meet the requirement under paragraph (3)(c). [Act No. 18 of 2018 , Sch.]"
    },
    {
      "provision_ref": "s27",
      "chapter": "Part III",
      "section": "27",
      "title": "General regulations for telecommunication services",
      "content": "(1) The Cabinet Secretary in consultation with the Commission may make regulations generally with respect to telecommunication services. (2) Without prejudice to the generality of subsection (1), the Cabinet Secretary in consultation with the Commission may make regulations with respect to— (a) the running of telecommunication systems; (b) the privacy of telecommunication; (c) the provision of telecommunication services pursuant to the provisions of section 23 and in particular, the manner in which such services shall be offered and performed, the issue of licences and the payment of fees in respect thereof, and such other matters as it deems fit; (d) the period during which and conditions subject to which messages and papers relating to telecommunication services belonging to, or in the custody of telecommunication operators shall be preserved; (e) the issue, variation and withdrawal of approvals in respect of contractors for relevant operations in connection with any telecommunication system and the maintenance of registers of such contractors; (f) fees and other charges for any matter permitted or matters required to be done under this Act in relation to telecommunication services; (g) the form of any licence, notice, approval, certificate, authority or other written document required or permitted to be issued by or submitted to the Commission in relation to telecommunication services; (gg) the registration of telecommunication subscribers; (h) the registration of subscribers to telecommunication services. (3) Regulations under this section may make different provisions with respect to different classes or descriptions of telecommunication systems, apparatus or services. (4) Any person who contravenes any regulation made under this section commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding three years, or to both. [Act No. 4 of 2012 , s. 52, Act No. 12 of 2012 , Sch.] Registration of SIM-Cards [Act No. 41A of 2013 , s. 12.]"
    },
    {
      "provision_ref": "s27A",
      "chapter": "Part III",
      "section": "27A",
      "title": "Duties of telecommunications operators",
      "content": "(1) Before a telecommunications operator sells a SIM- card or otherwise provides telecommunication services to a person, it shall obtain— (a) from natural persons, the person's full name, identity card number, date of birth, gender, physical and postal address; (b) from corporate persons or statutory bodies, official name, postal and physical address, particulars of registration, incorporation, enabling legislation or Gazette notice, as the case may be; and (c) such other information as may be prescribed from time to time. (2) A telecommunication operator shall ensure that— (a) existing subscribers register their SIM-cards within such time period as may be prescribed; (b) proper physical or electronic records are kept of the information referred to in subsection (1) and any change in such information; (c) the registration details of a subscriber are kept in a secure and confidential manner, and shall not be disclosed without the written consent of the subscriber. (3) Notwithstanding the provisions of subsection (2)(c), a telecommunications operator may disclose the registration particulars of a subscriber— (a) for the purpose of facilitating the performance of any statutory functions of the Authority; (b) in connection with the investigation of any criminal offence or for the purpose of any criminal proceedings; or (c) for the purpose of any civil proceedings under the Act. (3A) Subject to subsection (3B), a telecommunication operator shall, before levying or allowing to be levied, any specific charge relating to a premium rate service provided to a subscriber, disclose the fact, amount, and frequency of the charge to the subscriber. (3B) Subsection (3A) shall not apply to services rendered by a telecommunications operator on behalf of a public body. (4) Any telecommunications operator who contravenes this section commits an offence and shall be liable on conviction to a fine not exceeding five million shillings. [Act No. 41A of 2013 , s. 12, Act No. 11 of 2017 , Sch.]"
    },
    {
      "provision_ref": "s27B",
      "chapter": "Part III",
      "section": "27B",
      "title": "Registration by agents",
      "content": "(1) A telecommunications operator may contract or otherwise engage a registration agent for purposes of registering existing or new subscribers. (2) A registration agent shall— (a) ensure that proper registration of the subscriber is conducted prior to the selling of a SIM-card; (b) provide all records of registration to the telecommunications operator within such time after registration as may be prescribed; (c) ensure that the registration details of a subscriber are kept in a secure and confidential manner and are not disclosed to any other person; (3) A telecommunications operator shall keep a record of its registration agents and such record shall be made available to the Authority at such time and in such manner as may be prescribed. (4) A registration agent shall not hawk SIM-cards and shall ensure that they are sold and registered in a formal retail outlet. (5) A person who contravenes this section commits an offence and shall be liable on conviction to a fine not exceeding five hundred thousand shillings or imprisonment for a term not exceeding twelve months, or both. [Act No. 41A of 2013 , s. 12.]"
    },
    {
      "provision_ref": "s27C",
      "chapter": "Part III",
      "section": "27C",
      "title": "Duties of telecommunication subscribers",
      "content": "(1) A subscriber of telecommunications services shall— (a) provide the registration details required under section 27A ; (b) report to a telecommunications operator or a police station when his or her SIM-card is lost or stolen, within forty-eight hours of being lost or stolen or such other period as may be prescribed; (c) report any change in any identification details to a telecommunications operator within thirty days of the change taking place. (2) A subscriber shall be prima facie liable for activities or transactions carried out using a SIM-card, registered under the subscriber's name. (3) Notwithstanding subsection (2), a subscriber shall not be held liable if the subscriber can prove that he or she was not in control of the SIM-card at the time a particular activity or transaction was carried out. (4) A person who contravenes this section, or knowingly provides false information to a telecommunications operator or registration agent commits an offence and shall be liable on conviction a fine not exceeding one hundred thousand shillings or to imprisonment for a term not exceeding six months, or both. [Act No. 41A of 2013 , s. 12.]"
    },
    {
      "provision_ref": "s27D",
      "chapter": "Part III",
      "section": "27D",
      "title": "Regulations on SIM-card Registration",
      "content": "The Cabinet Secretary, in consultation with the Authority may make regulations with respect to— (a) procedure for SIM-card registration; (b) timelines for SIM-card registration, storage and retention of subscriber records; (c) confidentiality and disclosure of subscriber information; (d) registration of minors; (e) transfer of SIM-cards; (f) registration particulars; (g) suspension and deactivation of SIM-cards; and (h) any other matter that may be prescribed under this sub-Part. [Act No. 41A of 2013 , s. 12, Act No. 25 of 2015 , Sch.] Offences relating to Telecommunication Services"
    },
    {
      "provision_ref": "s28",
      "chapter": "Part III",
      "section": "28",
      "title": "Obtaining service dishonestly",
      "content": "A person who dishonestly facilitates or obtains a service provided by a person authorised under this Act to provide telecommunication services with intent to avoid payment of any charge applicable to the provision of that service commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years, or to both. [Act No. 1 of 2009 , s. 10.]"
    },
    {
      "provision_ref": "s29",
      "chapter": "Part III",
      "section": "29",
      "title": "Improper use of system",
      "content": "A person who by means of a licensed telecommunication system— (a) sends a message or other matter that is grossly offensive or of an indecent, obscene or menacing character; or (b) sends a message that he knows to be false for the purpose of causing annoyance, inconvenience or needless anxiety to another person, commits an offence and shall be liable on conviction to a fine not exceeding fifty thousand shillings, or to imprisonment for a term not exceeding three months, or to both."
    },
    {
      "provision_ref": "s30",
      "chapter": "Part III",
      "section": "30",
      "title": "Modification, etc., of messages",
      "content": "A person engaged in the running of a licensed telecommunication system who, otherwise than in the course of his duty, intentionally modifies or interferes with the contents of a message sent by means of that system, commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding three years, or to both."
    },
    {
      "provision_ref": "s31",
      "chapter": "Part III",
      "section": "31",
      "title": "Interception and disclosure",
      "content": "A licensed telecommunication operator who otherwise than in the course of his business— (a) intercepts a message sent through a licensed telecommunication system; or (b) discloses to any person the contents of a message intercepted under paragraph (a); or (c) discloses to any person the contents of any statement or account specifying the telecommunication services provided by means of that statement or account, commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings or, to imprisonment for a term not exceeding three years, or to both."
    },
    {
      "provision_ref": "s32",
      "chapter": "Part III",
      "section": "32",
      "title": "Tampering with telecommunication plant",
      "content": "A person who willfully, with intent to— (a) prevent, obstruct or delay transmission of any message; (b) interfere with the management or operation of a telecommunication apparatus; or (c) unlawfully intercept or acquaint himself or herself with the contents of any message; vandalizes, damages, removes, tampers with, touches or in any other way whatsoever interferes with any telecommunication apparatus or telecommunication line, post, or anything whatsoever, being part of or used in or about any licensed telecommunication system, commits an offence and shall be liable, on conviction to a fine of not less than five million shillings or to imprisonment for a term of not less than ten years or to both. [Act No. 12 of 2012 , Sch.]"
    },
    {
      "provision_ref": "s32A",
      "chapter": "Part III",
      "section": "32A",
      "title": "Severing with intent to steal",
      "content": "A person who, with intent to steal, severs any telecommunication apparatus or other works under the control of a licensee, commits an offence and is liable, on conviction, to a fine of not less than five million shillings or to imprisonment for a term of not less than ten years or to both. [Act No. 12 of 2012 , Sch.]"
    },
    {
      "provision_ref": "s33",
      "chapter": "Part III",
      "section": "33",
      "title": "Trespass and wilful obstruction of telecommunication officer",
      "content": "Any person who— (a) without permission, enters the equipment room of a telecommunication operator; or (b) enters any enclosure around the telecommunication office in contravention of any rule or notice to the contrary; or (c) refuses to leave such equipment room or enclosure on being requested to do so by any telecommunication officer; or (d) wilfully obstructs any such telecommunication officer or a telecommunication operator in the performance of his duty, commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding one year, or to both. [Act No. 1 of 2009 , s. 11.]"
    },
    {
      "provision_ref": "s34",
      "chapter": "Part III",
      "section": "34",
      "title": "Prohibition of unlicensed telecommunication system",
      "content": "(1) A person who, while not holding a valid licence under section 25 , runs a telecommunication system or provides a telecommunication service, commits an offence. (2) Any person who runs a telecommunication system in accordance with a licence granted under section 25 of this Act shall commit an offence if— (a) that person provides telecommunication services which are not of a description specified in the licence; or (b) there is connected to the licensed system, any telecommunication system or, as the case may be, any telecommunication apparatus which is not of a description so specified in the licence. (3) A person convicted of an offence under this section shall, on conviction be liable to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years, or to both. [Act No. 1 of 2009 , s. 12.] Part IV – RADIO COMMUNICATION"
    },
    {
      "provision_ref": "s35",
      "chapter": "Part IV",
      "section": "35",
      "title": "Licensing requirements",
      "content": "(1) Subject to subsection (2), no person shall, establish or use any radio communication station or apparatus except in accordance with the terms of a licence granted under section 36 . (2) A person who contravenes the provisions of subsection (1) commits an offence and shall be liable on conviction to a fine not exceeding five million shillings, or to imprisonment for a term not exceeding three years, or to both."
    },
    {
      "provision_ref": "s36",
      "chapter": "Part IV",
      "section": "36",
      "title": "Radio communication licence",
      "content": "(1) The Commission may, on application in the prescribed manner, grant a licence authorising any person or persons of a specified class to establish or to use any radio communication station or apparatus or to install or use any apparatus for radio communication. (2) A licence granted under this section may be issued subject to such terms, conditions and limitations as the Commission may think fit, including— (a) in the case of a licence to establish a station, limitations as to the position and nature of the station, the purposes for which, the circumstances in which, and the persons by whom the station may be used, and the apparatus which may be imported, installed or used therein; and (b) in the case of any other licence, limitations as to the apparatus which may be installed or used, and the places where, the purposes for which, the circumstances in which and the persons by whom the apparatus may be used. (3) A radio communication licence shall, unless earlier revoked in accordance with any term in that regard contained in the licence, continue in force for such period as may be specified therein. (4) Subject to the provisions of this Act, the Commission may renew or revoke a licence issued under this Part, or vary or modify any conditions attached thereto."
    },
    {
      "provision_ref": "s37",
      "chapter": "Part IV",
      "section": "37",
      "title": "Licences for scientific or research use",
      "content": "(1) Where an application for the grant or renewal of a radio communication licence is made to the Commission by any person, and the Commission is satisfied that the purpose of the licence is to enable the applicant to conduct experiments in radio communications for the purpose of scientific research, the Commission shall subject to subsection (2) not refuse to grant or renew the licence, and shall not revoke the licence when granted and no sum shall be payable under any regulations in respect of such licence except the fee for the grant or the renewal thereof. (2) Nothing in subsection (1) shall prevent the Commission from refusing to grant or renew, or from revoking, a radio communication licence if the applicant has, whether before or after the grant or last renewal of the licence, been convicted of any offence under this Act, whether in relation to any radio communication apparatus covered by such licence or any other radio communication apparatus, or has been convicted of using any apparatus for the purpose of interfering with any radio communication. (3) Nothing in subsection (1) shall limit the discretion of the Commission as to the conditions which it attaches to any radio communication licence or its power to vary the conditions of any such licence."
    },
    {
      "provision_ref": "s38",
      "chapter": "Part IV",
      "section": "38",
      "title": "Regulations on radio communication",
      "content": "(1) The Cabinet Secretary in consultation with the Commission may make regulations generally with respect to radio communication and, without prejudice to the generality of the foregoing, with respect to— (a) the fees or sums to be paid by a person to whom a radio-communication licence is granted on the grant or renewal of such licence and the conditions on which any such licence may be granted, renewed or revoked; (b) anything which may or may not be done in connection with the use of any radio communication station or apparatus and in particular, requiring the use of any such station or apparatus to cease on the demand in that behalf by any authorised employee of the Commission; (c) imposing on the person to whom a radio communication licence is granted with respect to any radio communication station or apparatus, or who is in possession or control of any radio communication station or apparatus, obligations as to permitting and facilitating the inspection of such station or apparatus, as to the conditions in which the radio station or apparatus is kept and, in the case of a station or apparatus for the establishment, installation or use of which a licence is necessary, as to the production of the licence or of such other evidence of the licensing of the station or apparatus as may be prescribed by the regulations; (d) where sums are or may become due from the person to whom a radio communication licence is granted after the grant or renewal thereof, requiring that person to keep and produce such accounts and records as may be specified in the regulations; (e) requiring the person to whom a radio communication licence authorising the establishment or use of a station has been granted, to exhibit at the station such notices as may be specified in the regulations; (f) regulating the use on board any vessel or aircraft, other than a vessel or aircraft registered or licenced in Kenya, within the limits of Kenya and territorial waters adjacent thereto, of radio communication apparatus on board such vessel or aircraft; (g) controlling the importation, acquisition, manufacture and sale, letting on hire or other disposition of radio communication apparatus of any kind, or the possession, use or installation of such, and different provisions may be made by such regulations for different classes of cases; (h) the licensing and fees in respect thereof, of dealers in radio communication apparatus and the sale, transfer or use of such apparatus; (i) the conduct of examinations for radio communication operators, the content of such examination and the issue of certificates of competence in respect thereof; (j) the issue, variation and withdrawal of approvals in respect of radio communication stations and radio communication apparatus and apparatus for connection to any telecommunication system licensed under this Act: Provided that nothing in any such regulations shall require any person to concede any form of right of entry into a private dwelling house for the purpose of permitting or facilitating the inspection of any radio communication apparatus not designed or adapted for emission. (2) Any person who contravenes any regulations made under this section, or causes or permits any radio communication station or apparatus to be used in contravention of any such regulations, commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years, or to both. [Act No. 1 of 2009 , s. 13.]"
    },
    {
      "provision_ref": "s39",
      "chapter": "Part IV",
      "section": "39",
      "title": "Regulations for radiation of electro-magnetic energy",
      "content": "(1) The Cabinet Secretary in consultation with the Commission may make regulations for the following purposes— (a) for prescribing the requirements to be complied with in the use of any apparatus to which this section applies; (b) for prescribing the requirements to be complied with in the case of any apparatus to which this section applies if the apparatus is to be sold or offered or advertised for sale otherwise than for export, or let or hire or offered or advertised for letting or hire by any person who in the course of business manufactures, assembles or imports such apparatus. (2) Regulations made under subsection (1) shall make provisions to ensure that the use of the apparatus does not cause undue interference with radio communication and may in particular include— (a) requirements as to the maximum intensity of electromagnetic energy of any specified frequencies which may be emitted in any direction from the apparatus while it is in use; and (b) in the case of any apparatus, the power for which is supplied from electric supply lines, requirements as to maximum electro-magnetic energy of any specified frequencies which may be injected into those lines by the apparatus, and different requirements may be prescribed for different circumstances and in relation to different classes or descriptions of apparatus, different districts or places and different times of use. (3) The apparatus to which this section applies shall be such apparatus, other than radio communication apparatus, as may be specified in the regulations, being apparatus generating or designed to generate or liable to generate fortuitously electro-magnetic energy at frequencies of not more than three million megahertz per second and references in this subsection to apparatus include references to any form of electric supply line. (4) It shall not be unlawful for any person to use any apparatus to which this section applies or to sell, offer, advertise for sale, let on hire or offer or advertise, such apparatus for letting on hire, by reason only that it does not comply with the requirements applicable under any regulations made under this section, but such non-compliance shall be a ground for the giving of a notice under section 41 or 43 of this Act, as the case may be."
    },
    {
      "provision_ref": "s40",
      "chapter": "Part IV",
      "section": "40",
      "title": "Regulations with respect to resistance to interference",
      "content": "(1) The Cabinet Secretary, in consultation with the Authority may, by regulations, prescribe technical requirements to be complied with in the case of radio communication apparatus specified in the regulations. (2) The technical requirements in respect of any apparatus shall be such as appear to the Commission to be appropriate for the purpose of minimising so far as practicable, the risk of interference, arising from lawful use of any other apparatus to which the requirements apply, or any apparatus used in connection with it and which it is designed or adapted to receive. (3) Any person who, in the course of business— (a) sells or offers for sale (otherwise than for export) any apparatus which does not comply with the technical requirements applicable to it under regulations made under this section; (b) lets on hires or offers to let or hire any such apparatus; or (c) indicates, whether by display of the apparatus or by any form of advertisement, his willingness to do anything in relation to any such apparatus, commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding three years, or to both. (4) In any proceedings for an offence under this section brought against any person other than one who in the course of business has manufactured, assembled or imported, the apparatus to which the proceedings relate, it shall be a defence for the accused person to show that he did not know and could not, with reasonable care, have ascertained that the apparatus did not comply with the requirements in question. (5) In this section \"apparatus\" means any radio communication station or any radio communication apparatus and includes any apparatus designed or adapted for use in connection with any radio communication station and radio communication apparatus. [Act No. 25 of 2015 , Sch.]"
    },
    {
      "provision_ref": "s41",
      "chapter": "Part IV",
      "section": "41",
      "title": "Enforcement of regulations as to use of apparatus",
      "content": "(1) If the Commission is of the opinion— (a) that any apparatus does not comply with the requirements applicable to it under regulations made for the purpose under subsection (1) of section 40 ; or (b) that either— (i) the use of the apparatus is likely to cause undue interference with any radio communication used for the purpose of any safety of life service or for any purpose on which the safety of any person or of any vessel, aircraft or vehicle may depend; or (ii) the use of the apparatus has caused or is causing undue interference with any other radio communication apparatus in circumstances where all reasonable steps to minimise interference have been taken in relation to the situation or apparatus receiving such radio communication, it may serve on the person in whose possession the apparatus is, a notice in writing requiring that, after a date fixed by the notice, not being less than thirty days from the date of service thereof, the apparatus shall not be used, whether by the person to whom the notice is given or otherwise, or shall only be used in such manner, at such times and in such circumstances as may be specified in the notice: Provided that if the Commission is satisfied that the use of the apparatus in question is likely to cause undue interference with any radio communication used for the purpose of any safety-of-life service or for any purpose on which the safety of any person or of any vessel, aircraft or vehicle may depend, the date to be fixed by the notice may be the date of the service thereof. (2) A notice under subsection (1) may be revoked or varied by a subsequent notice in writing by the Commission, served on the person in whose possession the apparatus then is: Provided that where a notice under this section has the effect of imposing any additional restrictions on the use of the apparatus, the provisions of subsection (1) relating to the coming into force of the notice shall apply in relation to the subsequent notice as if it had been a notice served under subsection (1). (3) Where a notice has been given under subsection (1), any person having possession of, or any interest in, the apparatus to which the notice relates may, at any time, whether before or after the date fixed by such notice, by notice in writing served on the Commission, show reasons why the apparatus in question complies with the requirements applicable to it under the regulations and if the Commission is satisfied that— (a) the apparatus in question so complies, it shall revoke the notice; or (b) the said requirements ought to be relaxed in relation to the apparatus, may revoke the notice or vary it in such manner as the Commission may deem fit: Provided that, nothing done under this subsection shall prevent any person from serving another notice and shall not, where the Commission is satisfied that there has been a change in the circumstances, prevent the Commission from giving a further notice. (4) A revocation or variation made under subsection (2) or (3) may be absolute or may be conditional on such steps being taken in relation to the apparatus or on the apparatus being made to comply with such requirements as may be specified in the direction and any questions as to whether or not the apparatus has been made to comply with the requirements shall, on the application of the Director-General or of any person having possession of or any interest in the apparatus, be determined by the Tribunal. (5) Any person who, knowing that a notice of the Commission under this section is in force with respect to any apparatus, uses such apparatus, or causes or permits it to be used in contravention of the notice, commits an offence and shall be liable on conviction to a fine not exceeding five hundred thousand shillings, or to imprisonment for a term not exceeding three years, or to both."
    },
    {
      "provision_ref": "s42",
      "chapter": "Part IV",
      "section": "42",
      "title": "Onus of proof",
      "content": "In any proceedings arising from the provisions of this Part— (a) the occupier of any dwelling house or premises in which there is any radio-communication apparatus shall be deemed to be in possession thereof, unless he satisfies the court that he was not aware and could not with reasonable diligence have become aware of the presence in the dwelling house or premises, of the apparatus in question; (b) any radio-communication apparatus which, if fully assembled and in working order, would be a radio communication station, shall not, unless completely dismantled, cease to be a radio communication station by reason of the fact that it is temporarily incapable of transmitting or receiving electromagnetic waves owing to a defect or absence of some part."
    },
    {
      "provision_ref": "s44",
      "chapter": "Part IV",
      "section": "44",
      "title": "Unlawfully sending of misleading messages, etc",
      "content": "Any person who— (a) by means of radio communication, sends or attempts to send any message which to his knowledge is false or misleading and is to his knowledge likely to prejudice the efficiency of any safety-of-life service or endanger the safety of any person, or of any vessel, aircraft or vehicle, and, in particular, any message which to his knowledge falsely suggests that a vessel or aircraft is in distress or in need of assistance or is not in distress or not in need of assistance; or (b) otherwise than under the authority of the Cabinet Secretary for the time being responsible for internal security- (i) uses any radio communication apparatus with intent to obtain information as to the contents, sender or addressee of any message, (whether sent by means of radio communication or not) which neither the person using the station or apparatus nor any person on whose behalf he is acting is authorised to receive; or (ii) except in the course of legal proceedings or for the purposes of any report thereon, discloses any information as to the contents, sender or addressee of any such message, being information which would not have come to his knowledge but for the use of the radio communication station or radio communication apparatus by him or by any other person acting on his behalf, commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years, or both. [Act No. 1 of 2009 , s. 14.]"
    },
    {
      "provision_ref": "s45",
      "chapter": "Part IV",
      "section": "45",
      "title": "Deliberate interference with radio communication",
      "content": "Any person who uses any station or apparatus for interfering with any radio communication commits an offence and shall be liable on conviction to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding five years or to both. [Act No. 1 of 2009 , s. 15.]"
    },
    {
      "provision_ref": "s46",
      "chapter": "Part IV",
      "section": "46",
      "title": "Extent of the application of provisions relating to radio communication",
      "content": "(1) The provisions relating to radio communication shall apply - (a) to all radio communication stations and radio communication apparatus in or over, or for the time being in or over Kenya or the territorial waters adjacent thereto; and (b) subject to any limitations which the Cabinet Secretary, in consultation with the Authority may, by regulations, determine, to all radio communication stations and radio communication apparatus which is released from within Kenya or its territorial waters, or from any vessel or aircraft which is registered in Kenya. (2) Without prejudice to the liability of any other person, in the event of the contravention of the provisions of subsection (1) or of any regulations or orders made thereunder, occurring in relation to any radio-communication station or radio communication apparatus on board or released from any vessel or aircraft, the captain or the person, for the time being, in charge of the vessel or aircraft commits an offence under this Act: Provided that this subsection shall not apply if the contravention consists of the use by a passenger, on board the vessel or aircraft, of any radio-communication apparatus not designed or adapted, for transmission (as opposed to reception) which is not part of the radio communication apparatus of the vessel or aircraft. (3) The Cabinet Secretary, in consultation with the Authority may make regulations for the use of radio-communication apparatus on board a vessel or aircraft not registered in Kenya while the vessel or aircraft is within the territorial limits of Kenya or its territorial waters. [Act No. 25 of 2015 , Sch.] Part IVA – BROADCASTING SERVICES AND CYBER SECURITY [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 23.]"
    },
    {
      "provision_ref": "s46A",
      "chapter": "Part IVA",
      "section": "46A",
      "title": "Functions of the Commission in relation to broadcasting services.",
      "content": "The functions of the Commission in relation to broadcasting services shall be to— (a) promote and facilitate the development, in keeping with the public interest of a diverse range of broadcasting services in Kenya; (b) facilitate and encourage the development of Kenyan programmes; (c) promote the observance at all times of public interest obligations in all broadcasting categories; (d) promote diversity and plurality of views for a competitive marketplace of ideas; (e) ensure the provision by broadcasters of appropriate internal mechanisms for disposing of complaints in relation to broadcasting services; (f) protect the right to privacy of all persons; (g) carry out such other functions as are necessary or expedient for the discharge of all or any of the functions conferred upon it under this Act; (h) administering the broadcasting content aspect of this Act; (i) developing media standards; and (j) regulating and monitoring compliance with those standards. [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 14.]"
    },
    {
      "provision_ref": "s46B",
      "chapter": "Part IVA",
      "section": "46B",
      "title": "Classification of Broadcasting Services",
      "content": "(1) Broadcasting services shall be classified for specified areas according to the following service categories— (a) public broadcasting; (b) private broadcasting; (c) community broadcasting. (2) Subject to the provisions of this Act, broadcasting service licences shall be categorized into the following classes— (a) free-to-air radio; (b) free-to-air television; (c) subscription radio; (d) subscription television: (e) subscription management; (f) any other class of licence as may be determined in accordance with the Regulations. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46C",
      "chapter": "Part IVA",
      "section": "46C",
      "title": "Requirement of a Broadcasting Licence",
      "content": "(1) Subject to this Act, no person shall provide broadcasting services except in accordance with a licence issued under this Part. (2) Any person who contravenes this section commits an offence and shall, on conviction, be liable to a fine not exceeding one million shillings, or to imprisonment for a term not exceeding three years, or to both. (3) A licence granted under this section may include conditions requiring the licensee to— (a) broadcast in such areas and within such geographical limits as the Commission may prescribe; (b) commit a minimum amount of time as may be prescribed, in its programme schedule to locally produced programmes, or, in the alternative, pay such amount of money as may be prescribed, into a Fund to assist the development of the Kenyan production industry; (c) pay such fees as the Commission may prescribe; and (d) fulfil such other conditions as the Commission may require. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46D",
      "chapter": "Part IVA",
      "section": "46D",
      "title": "Eligibility for licensing and consideration for grant of licence",
      "content": "(1) A person shall not be eligible for the grant of a broadcasting licence if such person— (a) is a political party; (b) is adjudged bankrupt or has entered into a composition or scheme of arrangement with his creditors; (c) is of unsound mind; (d) a public officer or a state offficer; (e) does not fulfill such other conditions as may be prescribed. (2) In considering applications for the grant of a broadcasting licence, the Commission shall have regard to— (a) observance at all times of public interest obligations in all broadcasting categories; (b) diversity and plurality of views for a competitive marketplace of ideas; (c) availability of radio frequency spectrum including the availability of such spectrum for future use; (d) efficiency and economy in the provision of broadcasting services; (e) demand for the proposed broadcasting service within the proposed broadcast area; (f) expected technical quality of the proposed service, having regard to developments in broadcasting technology; (g) suitability, capability, experience and expertise of the applicant in as far as carrying out such broadcast service is concerned; (h) financial means and business record, if any, of the applicant; and (i) any other relevant matter that the Commission may consider necessary. [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 15.]"
    },
    {
      "provision_ref": "s46E",
      "chapter": "Part IVA",
      "section": "46E",
      "title": "Public broadcasting services",
      "content": "The Kenya Broadcasting Corporation established under section 3 of the Kenya Broadcasting Corporation Act ( Cap. 221 ) is hereby designated as the public broadcaster and shall provide public broadcasting services. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46F",
      "chapter": "Part IVA",
      "section": "46F",
      "title": "Community broadcasting services",
      "content": "(1) The Commission may upon application in the prescribed manner and subject to such conditions as the Commission may deem necessary, grant a licence authorizing the provision of community broadcasting services. (2) The Commission in considering applications for grant of a licence under this section shall have regard— (a) to the community of interests of the persons applying for or on whose behalf the application is made: (b) as to whether the persons, or a significant proportion thereof constituting the community have consented to the application; (c) to the source of funding for the broadcasting service; (d) as to whether the broadcasting service to be established is not-for-profit; and (e) to the manner in which members of the community will participate in the selection and provision of programmes to be broadcast. (3) A licence granted under this section may contain conditions requiring the licensee to— (a) ensure that a cross section of the community is represented in the management of the broadcasting service; (b) ensure that each member of the community has a reasonable chance to serve in the management of the broadcasting service; (c) ensure that members of the community have a way of making their preferences known in the selection and provision of programmes; (d) conform to any conditions or guidelines as the Commission may require or issue with regard to such broadcasting service. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46G",
      "chapter": "Part IVA",
      "section": "46G",
      "title": "Private Broadcasting Services",
      "content": "(1) Subject to this Act, the Commission may grant a licence to any person to provide private broadcasting services. (2) A licence granted under this section may include conditions requiring the private broadcaster to— (a) provide coverage in such areas as may be specified by the Commission; (b) in the case of television, include drama, documentaries and children's programmes that reflect Kenyan themes. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46H",
      "chapter": "Part IVA",
      "section": "46H",
      "title": "Commission to prescribe programme code",
      "content": "(1) The Commission shall have the power to set standards for the time and manner of programmes to be broadcast by licensees under this Act. (2) Without prejudice to the generality of subsection (1), the Commission shall— (a) prescribe a programming code; (b) review the programming code at least once every two years; (c) prescribe a watershed period programming when large numbers of children are likely to be watching or listening to programmes; and (d) ensure compliance with the programming code prescribed under this section: Provided that the programming code referred to herein shall not apply where a licensee is a member of a body which has proved to the satisfaction of the Commission that its members subscribe and adhere to a programming code enforced by that body by means of its own mechanisms and provided further that such programming code and mechanisms have been filed with and accepted by the Commission. [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 16.]"
    },
    {
      "provision_ref": "s46I",
      "chapter": "Part IVA",
      "section": "46I",
      "title": "Responsibilities of broadcasters",
      "content": "(1) All licensed broadcasters shall— (a) provide responsible and responsive programming that caters for the varied needs and susceptibilities of different sections of the Kenyan community; (b) ensure that Kenyan identity is developed and maintained in programmes; (c) observe standards of good taste and decency; (d) gather and present news and information accurately and impartially; (e) when controversial or contentious issues of public interest are discussed, make reasonable efforts to present alternative points of view either in the same programme or in other programmes within the period of current interest; (f) respect the right to privacy of individuals; (g) respect copyright and neighbouring rights in respect of any work or material; (h) keep a program log or machine readable record of its programming for a period of one year after the date of broadcasting; (i) ensure that advertisements, either in terms of content, tone or treatment are not deceptive or are not repugnant to good taste; (j) ensure that derogatory remarks based on ethnicity, race, creed, colour and sex are not broadcast. (2) Where— (a) any cinematograph film has been submitted under any law for classification or censorship and approved for exhibition; and (b) where approval of the film for exhibition has been denied or has been given subject to excisions, no broadcaster shall— (i) in the case of any film in respect of which such approval has been denied, broadcast the film or any part thereof; or (ii) in the case of any film that has been approved for exhibition subject to excisions therefrom, broadcast that film or any part thereof if the film or, as the case may be, that part thereof includes any part of the film required to be excised, except with the consent of and subject to any conditions given by the Kenya Film Censorship Board established under the Films and Stage Plays Act ( Cap. 222 ). (3) A broadcaster licensed to distribute radio or television programme shall broadcast on radio or television such percentage of Kenyan programmes as shall be prescribed by the Authority. [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 17.]"
    },
    {
      "provision_ref": "s46J",
      "chapter": "Part IVA",
      "section": "46J",
      "title": "Revocation of licences",
      "content": "The Commission may in accordance with this Act revoke a licence to broadcast where the licensee— (a) is in breach of the provisions of the Act or regulations made thereunder; (b) is in breach of the conditions of a broadcasting licence; or (c) fails to utilize the assigned broadcasting frequencies within such period as the Authority shall stipulate in the licence. [Act No. 1 of 2009 , s. 16, Act No. 41A of 2013 , s. 18.]"
    },
    {
      "provision_ref": "s46K",
      "chapter": "Part IVA",
      "section": "46K",
      "title": "Regulations on broadcasting",
      "content": "The Cabinet Secretary may, in consultation with the Commission, make regulations generally with respect to all broadcasting services and without prejudice to the generality of the foregoing, with respect to— (a) the facilitation, promotion and maintenance of diversity and plurality of views for a competitive marketplace of ideas; (b) financing and broadcast of local content; (c) mandating the carriage of content, in keeping with public interest obligations, across licensed broadcasting services; (d) prescribing anything that may be prescribed under this Part. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46L",
      "chapter": "Part IVA",
      "section": "46L",
      "title": "Requirement on complaints procedure",
      "content": "(1) All broadcasters shall establish and maintain a procedure, by which persons aggrieved by any broadcast or who allege that a broadcaster is not complying with this Act, may file complaints. (2) The procedure referred to in subsection (1) shall be submitted to the Commission for approval. (3) Where any person alleges that he has exhausted the procedure mentioned in subsection (1) but is not satisfied with the remedy offered or action taken, he may appeal to the Commission. (4) Complaints made under this section shall be made in writing within thirty days of the breach under subsection (1) and shall set out the grounds upon which they are based, the nature of damage or injury suffered as result of the broadcast or the violation complained of and the remedy sought. (5) Any person who is aggrieved by a decision of the Commission made under this section may appeal to the Tribunal within thirty days after the decision. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46M",
      "chapter": "Part IVA",
      "section": "46M",
      "title": "Access to programmes",
      "content": "The Commission or the Tribunal may with a view to solving any dispute brought under section 46L require a licensee to— (a) provide the Commission, the Tribunal or the complainant with a transcript of the broadcast complained of; (b) furnish the Commission, the Tribunal or the complainant with copies of any document that may assist in resolving the dispute: or (c) furnish the Commission or the Tribunal with any written or oral evidence to assist in resolving the dispute or in answer to the complaint. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46N",
      "chapter": "Part IVA",
      "section": "46N",
      "title": "Requirement for a licence for signal distribution",
      "content": "(1) Subject to this Act, no person shall provide signal distribution services within Kenya or from Kenya to other countries except in accordance with a licence issued under this Part. (2) Any person who contravenes subsection (1) shall be guilty of an offence and shall, on conviction, be liable to a fine not exceeding one million shillings or to imprisonment for a term not exceeding three years, or both. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46O",
      "chapter": "Part IVA",
      "section": "46O",
      "title": "Signal Distribution services",
      "content": "(1) The Commission may upon an application in the prescribed manner and subject to such conditions as it may deem necessary, grant a licence authorizing any person or persons to provide signal distribution services. (2) A signal distribution licence granted under this section may require the signal distribution licensee to— (a) provide signal distribution services as a common carrier to broadcasting licensees; (b) provide services promptly upon request, in an equitable, reasonable non-preferential and nondiscriminatory manner; (c) provide capability for a diversity of broadcast services and content; (d) provide an open network that is interoperable with other signal distribution networks; and (e) comply with any other conditions that the Commission may determine. (3) A signal distribution licensee utilizing the radio frequency resource may be required by the Commission to comply with conditions as to the nature and location of transmitters and their transmission characteristics. (4) A licensee who changes the nature, location or transmission characteristics approved in terms of subsection (1) without the approval of the Commission commits an offence and shall on conviction be liable to a fine not exceeding one million shillings or imprisonment for a term not exceeding three years or, to both. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46P",
      "chapter": "Part IVA",
      "section": "46P",
      "title": "Revocation or signal distribution licence",
      "content": "The Commission may revoke a licence under this Part where the licensee or a person under the control of the licensee- (a) is in breach of this Act or regulations made thereunder; (b) is in breach of the conditions of a licence; (c) fails to commence operations within the period prescribed by the Commission. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46Q",
      "chapter": "Part IVA",
      "section": "46Q",
      "title": "Offences relating to broadcasting services",
      "content": "(1) Any person who provides a broadcasting service without a broadcasting licence commits an offence. (2) Any person who provides a broadcasting service pursuant to a licence granted under this Act commits an offence if— (a) that person provides a broadcasting service which is not of a description specified in the licence; (b) that person provides broadcasting services in an area for which he is not licensed to broadcast; or (c) that person broadcasts in contravention of the Act or the licence conditions. (3) A person convicted of an offence under this section shall, on conviction, be liable to a fine not exceeding one million shillings or to imprisonment for a term not exceeding three years, or both. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s46R",
      "chapter": "Part IVA",
      "section": "46R",
      "title": "Transitional provisions",
      "content": "The transitional provisions set out in the Fifth Schedule to this Act shall have effect with respect to broadcasting permits issued prior to the commencement of this Act. [Act No. 1 of 2009 , s. 16.]"
    },
    {
      "provision_ref": "s47",
      "chapter": "Part V",
      "section": "47",
      "title": "Functions of the Commission in relation to postal services",
      "content": "(1) The functions of the Commission in relation to postal services shall be to— (a) ensure that there are provided throughout Kenya good and sufficient postal and other related services, on such terms as the Commission may deem expedient; (b) ensure that the public post licensee is able to provide postal services at rates consistent with efficient and continuous service and financing viability; (c) promote development of postal systems and services in accordance with recognised international standards, practices and public demand; (d) exercise licensing and regulatory functions in respect of postal systems and services in Kenya in accordance with this Act; (e) regulate the fixing of rates of postage and other fees or sums to be charged in respect of postal articles weighing not more than three hundred and fifty grams; (f) regulate the issuance of postage stamps including definitive, commemorative and special issues of postage stamps and any other philatelic items; (g) ensure the terms and conditions stated in any licence granted under section 51 are complied with; (h) promote competition in the provision of postal services; (i) ensure that reasonable demands for postal services are satisfied; (j) promote and encourage the expansion of postal services in Kenya; and (k) further the advancement of technology relating to the post and postal services. (2) In discharging the functions and duties under subsection (1), the Commission shall have regard to— (a) efficiency and economy; (b) fostering the development and expansion of postal services in Kenya in collaboration with other countries and international organisations; (c) the maintenance of effective competition between persons providing or interested in providing postal services; (d) the promotion of measures for the safety of life through communications; (e) the provision of postal service rates consistent with efficient service and the necessity for maintaining financial viability; and (f) the promotion and development of standards in the field of postal systems and services."
    },
    {
      "provision_ref": "s48",
      "chapter": "Part V",
      "section": "48",
      "title": "Exclusive right to provide certain postal services",
      "content": "(1) The Commission may grant to the public postal licensee the exclusive right to provide private letter boxes or bags and postal services except in relation to— (a) letters weighing more than three hundred and fifty grams; (b) trade announcements, circulars, printed extracts from newspapers or advertisements not addressed to any particular person; (c) letters delivered by an employee of the sender; (d) letters delivered by a messenger employed by the sender especially for the purpose, not being a person employed or engaged in the course of his business or employment in delivering or procuring the delivery of letters; (e) letters concerning goods sent with the goods and delivered therewith; (f) letters carried to or from a post office; (g) letters carried in accordance with an agreement entered with the public postal licensee; (h) transfers between document exchanges; (i) letters carried to the premises of a provider of electronic mail services for the purposes of being transmitted as electronic mail, or letters carried from the premises of such a person after having been transmitted; (j) letters carried privately and delivered without hire, reward or other profit; (k) letters carried and delivered personally by the sender; and (l) letters, postcards, aerogrammes of three hundred and fifty grams or less in weight, if a charge of at least five times the basic charge of the public postal licensee letter rate for that class of item is made in respect of receiving, collecting, sending, despatching and delivery. (2) If any question arises as to whether or not any postal article is a letter within the meaning of this Act, the decision of the Commission thereon shall be final. [Act No. 41A of 2013 , s. 20.]"
    },
    {
      "provision_ref": "s49",
      "chapter": "Part V",
      "section": "49",
      "title": "Requirement of licence",
      "content": "(1) Subject to the provisions of this Act, no person shall operate or provide postal services except in accordance with a valid licence issued in accordance with this Part. (2) A person who contravenes the provisions of this section commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding one year, or to both. (3) In this section, \"person\" means a natural or a corporate person, a firm, government, state or state agency, any association or partnership. [Act No. 1 of 2009 , s. 17.]"
    },
    {
      "provision_ref": "s50",
      "chapter": "Part V",
      "section": "50",
      "title": "Designation of public postal licensee",
      "content": "The Authority may, by notice in the Gazette , designate a postal licensee to be the public postal licensee. [Act No. 41A of 2013 , s. 21.]"
    },
    {
      "provision_ref": "s51",
      "chapter": "Part V",
      "section": "51",
      "title": "Licence to provide postal services",
      "content": "(1) The Commission may, upon application in the prescribed manner and subject to the conditions specified in section 52 or such other conditions as the Commission may deem necessary, grant a licence in the prescribed form authorising any person to operate or to provide postal services in accordance with the provisions of this Act. (2) A licence granted under this section shall unless earlier revoked in accordance with any term specified therein, continue in force for such period as may be specified therein. (3) Subject to the provisions of this Act, the Commission may renew or revoke a licence issued under this section or vary or modify any conditions attached thereto."
    },
    {
      "provision_ref": "s52",
      "chapter": "Part V",
      "section": "52",
      "title": "Conditions of licence",
      "content": "Every licensee shall be required to observe the following conditions— (a) to provide courier services to any person, who requests for such services where available; (b) to notify the Commission forthwith of the current tariffs charged for postal services and changes to the tariffs for each different type of postal service provided to each location within thirty days of such changes; (c) to display prominently at each premises from which it conducts its business, current tariffs for each postal service to various destinations; (d) to comply with all applicable and relevant laws, rules and regulations including, but not limited to the law relating to customs and imports and exports with regard to receipt and dispatch of postal articles to and from Kenya; (e) to furnish the Commission with a copy of its latest audited annual accounts and financial statements of the business with the application for renewal of its licence; (f) if the licensee is a company with a share capital, to provide documentary evidence of current status of shareholding together with the applicant for renewal of its licence; (g) where the licensee intends to enter into any association, contract or arrangement with a third party, to provide postal services which only the licensee is permitted under its licence to provide, to seek approval from the Commission before entering into such association, contract or arrangement; (h) to exercise its rights and powers and perform its duties and obligations under the licence in such manner as is consistent with the agreements or treaties to which Kenya is a party; (i) not to enter into any arrangement with any person running an international postal service on terms and conditions which the Commission deems to be unfavourable to the national interest. General Provisions Relating to Postal Services"
    },
    {
      "provision_ref": "s53",
      "chapter": "Part V",
      "section": "53",
      "title": "Postage Stamps and postal charges",
      "content": "The public postal licensee shall have exclusive rights to issue postage stamps and provide private letter boxes subject to such conditions as the Commission may specify."
    },
    {
      "provision_ref": "s55",
      "chapter": "Part V",
      "section": "55",
      "title": "Postal articles not to be opened",
      "content": "(1) Subject to this Act, where any postal article is in the course of transmission by post, no employee of the licensee shall open it or deliver it to any person other than the addressee, or permit it to be opened or delivered to any person other than the addressee, unless he is authorised to do so by express authority in writing under the hand of the licensee: Provided that, nothing in this Part shall preclude the examination of any postal article and the disposal of any article in accordance with the provisions of any law— (a) relating to customs; or (b) prohibiting or regulating the importation or exportation of any article. (2) The licensee may, in any individual case which appears to warrant such a course of action, grant its warrant for opening or returning any specified postal article."
    },
    {
      "provision_ref": "s57",
      "chapter": "Part V",
      "section": "57",
      "title": "Article or material injurious to persons",
      "content": "(1) No person shall send by post any material or postal article which is likely to injure any person in the course of transmission by post. (2) Except as otherwise provided by regulations made under this Act and subject to such conditions as may be prescribed, no person shall send by post any explosive, inflammable, dangerous, filthy, noxious or deleterious substance or any sharp instrument not properly protected which is likely to injure any person or any postal article in the course of transmission by post."
    },
    {
      "provision_ref": "s58",
      "chapter": "Part V",
      "section": "58",
      "title": "Prohibited materials",
      "content": "No person shall send by post— (a) any indecent or obscene printing, photograph, lithograph, engraving, book or card or any other indecent or obscene article; (b) any postal article having thereon, or on the cover thereof, any words or designs of an indecent, obscene, scurrilous, threatening or grossly offensive character; (c) any postal article bearing any fictitious stamp or purporting to be prepaid with any postage stamp which has previously been used in payment of any stamp duty; (d) any other article which the Commission may by regulation prohibit."
    },
    {
      "provision_ref": "s59",
      "chapter": "Part V",
      "section": "59",
      "title": "Regulations prohibiting injurious articles",
      "content": "The Commission may make regulations in respect of the articles prohibited by section 58 and for the detaining, disposing of, or destroying any such postal article sent or tendered for transmission by post."
    },
    {
      "provision_ref": "s60",
      "chapter": "Part V",
      "section": "60",
      "title": "Material sent in contravention of this Act",
      "content": "(1) Where any postal article sent by post is reasonably suspected by the public postal licensee or other person licensed to provide postal services under this Act to have been sent in contravention of this Act or of any of the regulations made thereunder, or of any other written law, the public postal licensee or such other person shall immediately inform the Commission and hand over such postal article to the Commission or any person authorised in writing by the Commission. (2) On receiving the aforesaid information, an authorised officer shall detain such postal article for opening and examination. (3) Subject to the provisions of this Act, if any postal article opened or examined under this section is found to be in contravention or to have been posted in contravention of this Act, or of any regulations made thereunder, or of any other written law, such postal article shall be dealt with in accordance with regulations made under section 66 . (4) Notwithstanding any provisions of any written law to the contrary, if any postal article opened under this Act is found to be in contravention of any law relating to customs, it shall be handed over to the customs authority to be dealt with in accordance with such law. (5) The detention, destruction or disposal under this Act of a postal article or its contents shall not relieve any person sending or delivering it, from liability for any offence under this Act or under any other written law."
    },
    {
      "provision_ref": "s61",
      "chapter": "Part V",
      "section": "61",
      "title": "Power to deal with postal articles containing anything in respect of which an offence is committed",
      "content": "(1) If any licensee under this Part has reason to believe that any postal article contains anything in respect of which an offence is being or has been committed, or is being attempted to be committed, such licensee may require, by notice in writing, the attendance, at a specified post office and time, of the addressee of such postal article or of some agent deputised in writing by such addressee and of a police officer, and such postal article shall then be opened by the addressee or his agent in the presence of an authorised employee and of the police officer. (2) If the addressee or his agent fails to attend in pursuance of the notice under subsection (1) or refuses to open the article, it shall be opened by the authorised employee of the licensee in the presence of the police officer. (3) Where the postal article has been opened under this section, it shall be delivered to the addressee unless the police officer states that it is required for the purpose of any legal proceedings, in which event it shall be delivered to the police officer on his signing a receipt therefor. (4) Where the licensee is requested by the Commissioner of Police to exercise its powers under this section, it shall do so and thereupon the notice referred to in subsection (1) shall be issued."
    },
    {
      "provision_ref": "s63",
      "chapter": "Part V",
      "section": "63",
      "title": "Postal financial services",
      "content": "(1) The Commission shall allow the public postal licensee to carry out postal financial services on its own account. (2) For the purposes of this section, “postal financial services” include money orders, postal orders, postal drafts, postal cheques, postal traveller’s cheques, giro, cash-on-delivery, collection of bills, savings service, subscription to newspapers and periodicals or any other form of financial service as the Commission may prescribe."
    },
    {
      "provision_ref": "s64",
      "chapter": "Part V",
      "section": "64",
      "title": "Refund of wrong payment of money order",
      "content": "Where any person receives— (a) any amount paid to him in respect of a money order by an employee of the public postal licensee, in excess of that which ought to have been paid to him; or (b) any amount in respect of a money order paid to him by an employee of the public postal licensee, instead of to some other person to whom it ought to have been paid, the public postal licensee may call upon that person to refund immediately to such licensee the amount wrongly paid."
    },
    {
      "provision_ref": "s65",
      "chapter": "Part V",
      "section": "65",
      "title": "Proof of return, of postal articles",
      "content": "In any proceedings for the recovery of any postage or other charge alleged to be due under this Act in respect of any postal article— (a) the production of the postal article having thereon the official mark of the licensee or the signature of an employee of the licensee denoting that the article has been refused, returned unopened or unclaimed, or that the addressee is dead or cannot be found, shall be prima facie evidence of the fact so denoted; (b) the person from whom the postal article is supposed to have come shall, until the contrary is proved, be deemed to be the sender thereof; and (c) the production of the postal article, having thereon the official mark of the public postal licensee denoting that any postage or other charge is due in respect thereof to the operator or to the postal administration of any foreign country, shall be conclusive evidence for all purposes that the sum so denoted is due."
    },
    {
      "provision_ref": "s66",
      "chapter": "Part V",
      "section": "66",
      "title": "Regulations for postal services",
      "content": "The Cabinet Secretary in consultation with the Commission may make regulations generally with respect to postal services and, without prejudice to the generality of the foregoing, with respect to— (a) the disposal of undelivered postal articles; (b) the licensing and use of franking machines for pre-payment of postage and the use of postal franks; (c) specifying the conditions for the perforation or defacement of postage stamps and the conditions on which postage stamps may be accepted or refused in payment of postage or other charges; (d) specifying the conditions on which compensation may be paid for the loss of or damage to any postal article; (e) specifying the conditions for the registration and insurance of postal articles; (f) specifying the conditions for the issue and payment of money orders at post offices; (g) specifying the conditions subject to which any postal article in the course of transmission by post may be redelivered to the sender without reference to the consent of the addressee; and (h) specifying the conditions for the acceptance of cash-on-delivery postal articles. Offences relating to Postal Services"
    },
    {
      "provision_ref": "s67",
      "chapter": "Part V",
      "section": "67",
      "title": "Operating without a valid licence",
      "content": "A person who otherwise than in accordance with the terms of a valid licence issued under section 51 — (a) conveys any letter or postal article; (b) performs any service incidental to conveying, any letter or postal article; (c) delivers or tenders in order to be sent otherwise than in accordance with the terms of a valid licence any letter or postal article as aforesaid; or (d) makes a collection of letters or postal articles for the purpose of sending them; commits an offence and shall be liable on conviction to a fine not exceeding two hundred thousand shillings or to imprisonment for a term not exceeding one year, or to both. [Act No. 1 of 2009 , s. 18.]"
    },
    {
      "provision_ref": "s68",
      "chapter": "Part V",
      "section": "68",
      "title": "Damaging letter box",
      "content": "A person who places in or against any letter box provided by the public postal licensee for the reception of postal articles any fire, match or light, or any explosive, dangerous, filthy, noxious, or deleterious substance or any fluid, or commits a nuisance in or against any such letter box, or does anything likely to injure any such letter box or its appurtenances or contents, commits an offence and shall, be liable on conviction, to a fine not exceeding one hundred thousand shillings, or to imprisonment for a term not exceeding two years, or to both."
    },
    {
      "provision_ref": "s69",
      "chapter": "Part V",
      "section": "69",
      "title": "Affixing materials on post office",
      "content": "A person who, without the authority of the public postal licensee, affixes any placard, advertisement, notice, document, board or other thing in or on, or paints tar, or in any way disfigures any post office commits an offence and shall, be liable on conviction to a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding two years, or to both. [Act No. 1 of 2009 , s. 19.]"
    },
    {
      "provision_ref": "s70",
      "chapter": "Part V",
      "section": "70",
      "title": "Unlawful opening or delivery, etc., of postal articles by employees of licensee",
      "content": "A person who, being an employee of the public postal licensee or being employed in connection with postal services— (a) opens or permits to be opened any postal article otherwise than in accordance with the provisions of this Act; (b) knowingly reveals, discloses or in any way makes known the contents of, or any information in relation to, any postal article opened under the authority of this Act, otherwise than in accordance with the law; (c) knowingly destroys, detains or secretes any mail bag or postal article otherwise than in accordance with this Act; (d) knowingly permits any unauthorised person to interfere in any way with any mail bag or postal article; or (e) fraudulently or with intent to deceive prepares, alters, secretes or destroys any document used for the purposes of postal services, commits an offence and shall on conviction be liable to a fine not exceeding two hundred thousand shillings, or to imprisonment for a term not exceeding two years, or to both."
    },
    {
      "provision_ref": "s71",
      "chapter": "Part V",
      "section": "71",
      "title": "Transmitting offensive material by post",
      "content": "Any person, who without lawful excuse, the proof of which shall lie on the person charged, sends or procures to be sent by post, a postal article which has thereon or enclosed therein any word, drawing or picture of a scurrilous, threatening, obscene or grossly offensive character, commits an offence and shall on conviction be liable a fine not exceeding three hundred thousand shillings, or to imprisonment for a term not exceeding three years or to both. [Act No. 1 of 2009 , s. 20.]"
    },
    {
      "provision_ref": "s72",
      "chapter": "Part V",
      "section": "72",
      "title": "Unlawful opening of postal articles, etc., by non-employees of licensee",
      "content": "Any person who, not being an employee of the public postal licensee or not being employed in connection with postal services— (a) opens any postal article otherwise than in accordance with this Act; (b) interferes in any way with any mailbag or postal article opened under the authority of this Act, otherwise than in accordance with the law; (c) fraudulently puts, alters, removes or erases any official mark on a postal article; (d) maliciously and without authority, the proof of which authority shall lie on the person charged, opens, destroys, detains or secretes any article after it has been transmitted by post and before it has been delivered to the addressee; (e) without the authority of the public postal licensee, the proof of whose authority shall lie on the person charged, knowingly enters any premises used for the purpose of the postal services and to which the public has no right of access; (f) refuses or fails to leave any such premises when called upon so to do by an authorised employee of the public postal licensee; or (g) wilfully and unlawfully obstructs or impedes any employee of the public postal licensee or any other person in the discharge of his duties in connection with postal services, commits an offence and shall, on conviction, be liable to an imprisonment for a term not exceeding three years or to a fine not exceeding three hundred thousand shillings or to both. [Act No. 1 of 2009 , s. 21.]"
    },
    {
      "provision_ref": "s73",
      "chapter": "Part V",
      "section": "73",
      "title": "Using of fictitious stamps",
      "content": "Any person who— (a) makes or knowingly utters, deals in, hawks, distributes, or sells any fictitious stamps or knowingly uses for postal purposes any fictitious stamps; (b) has in his possession without lawful excuse any fictitious stamp; (c) makes, issues or sends by post any stamped or embossed envelope, wrapper, card, form or paper in imitation of one issued under the authority of the public postal licensee; commits an offence and shall be liable on conviction to a fine not exceeding five hundred thousand shillings or to imprisonment for a term not exceeding two years, or to both. [Act No. 1 of 2009 , s. 22.]"
    },
    {
      "provision_ref": "s74",
      "chapter": "Part V",
      "section": "74",
      "title": "Use of certain words",
      "content": "Any person who, without authority from the Commission, places or maintains or permits to be placed or maintained in or on any house, wall, door, window, box, pillar or other place, belonging to him or under his control, any of the following words, letters, or marks— (a) the words “post office” or “postal office”; (b) the words “letter box”, accompanied with words, letters, marks, which signify or imply or may reasonably lead the public to believe that it is a post office letter box; (c) any words, letters, or mark which signify or imply or may lead the public to believe that any house or place is a post office, or that any box is a post office letter box, commits an offence and shall be liable on conviction to a fine not exceeding ten thousand shillings. [Act No. 1 of 2009 , s. 23.]"
    },
    {
      "provision_ref": "s75",
      "chapter": "Part V",
      "section": "75",
      "title": "Transmitting prohibited articles by post",
      "content": "Any person who— (a) sends by post any postal article which is prohibited from being so transmitted under any regulations made under this Act; (b) sends by post, otherwise than in accordance with any regulations made under this Act, any postal article containing any noxious, explosive or dangerous substance which would be likely to damage any other postal article; (c) subscribes on the outside of any postal article, or makes in any declaration relating to a postal article, any statement which he knows or has reason to believe to be false, or which he does not believe to be true, in relation to the contents or value thereof; or (d) with intent to defeat the course of justice sends by post any postal article containing anything with respect to which, or in connection with which any offence, to his knowledge, has been or is being committed, commits an offence and shall, be liable on conviction to a fine not exceeding three hundred thousand shillings or to imprisonment for a term not exceeding three years, or to both. [Act No. 1 of 2009 , s. 24.]"
    },
    {
      "provision_ref": "s76",
      "chapter": "Part V",
      "section": "76",
      "title": "Interfering with postal installation",
      "content": "Any person who unlawfully and wilfully removes, destroys or damages any installation or plant used for postal services commits an offence and shall on conviction, be liable to a fine not exceeding five hundred thousand shillings or to imprisonment for a term not exceeding three years, or to both. [Act No. 1 of 2009 , s. 25.] Part VI – LICENSING AND ENFORCEMENT [Act No. 1 of 2009 , s. 26.]"
    },
    {
      "provision_ref": "s77",
      "chapter": "Part VI",
      "section": "77",
      "title": "Application for licence",
      "content": "(1) Every application for a licence under this Act shall be in the prescribed form addressed to the Commission and shall be accompanied by such fee as may be prescribed. (2) The Commission may, with respect to any application, require the applicant to supply such additional information as it may consider necessary in considering the application."
    },
    {
      "provision_ref": "s78",
      "chapter": "Part VI",
      "section": "78",
      "title": "Notice of licence",
      "content": "(1) The Commission shall, at least thirty days before granting a licence under this Act, give notice in the Gazette and in such other manner as the Commission considers appropriate— (a) specifying the name and other particulars of the person or class of persons to whom the licence is to be granted; (b) stating the reasons for the proposed grant of the licence; and (c) specifying the time (not being less than thirty days from the date of the notice) within which written representations or objections in respect of the proposed licence may be made to the Commission: Provided that nothing in this subsection shall apply in respect of licences for— (i) telecommunications vendors; (ii) radio-communications; or (iii) value-added or resale services. (2) The Commission shall in considering the application, take into account any written representations or objections received under subsection (1)(c). [Act No. 1 of 2009 , s. 27.]"
    },
    {
      "provision_ref": "s79",
      "chapter": "Part VI",
      "section": "79",
      "title": "Grant of licence",
      "content": "The Commission may, upon expiry of the period of notice under section 78 grant a licence to the applicant if satisfied that the applicant should be licensed, subject to such conditions, including the payment of such licence fee as may be prescribed: Provided that where the Commission does not grant a licence, it shall notify the applicant in writing of the reasons for refusal within thirty days of such refusal and the applicant may, if aggrieved, appeal to the Tribunal. [Act No. 1 of 2009 , s. 28.]"
    },
    {
      "provision_ref": "s80",
      "chapter": "Part VI",
      "section": "80",
      "title": "Duration of licence",
      "content": "A licence granted under this Act shall, unless earlier revoked in accordance with any term in that regard contained in the licence, continue in force for such period as may be specified in the licence."
    },
    {
      "provision_ref": "s81",
      "chapter": "Part VI",
      "section": "81",
      "title": "Renewal of licence",
      "content": "A licence issued under this Act may, on application and subject to the payment of the prescribed fee, be renewed for such further period as the Commission may specify: Provided that where the Commission does not renew the licence it shall notify the licensee in writing of the reasons for refusal within thirty days, and the licensee may, if aggrieved, appeal to the Tribunal."
    },
    {
      "provision_ref": "s82",
      "chapter": "Part VI",
      "section": "82",
      "title": "Modification of conditions of licence",
      "content": "(1) Subject to the provisions of this Act, the Commission may, from time to time, modify any conditions attached to a licence under this Act. (2) Subject to subsection (4), before making any modifications under this section, the Commission shall give notice in writing and by publication in the Gazette to the licensee— (a) stating that it proposes to make the modification and setting out the effects of such modification; (b) giving reasons for the modification; and (c) specifying the time (not being less than thirty days from the date of publication of the notice) within which any written objections or representations may be made by the licensee or by any interested party with respect to the proposed modifications: Provided that nothing in this subsection shall apply in respect of licences for— (i) telecommunication vendors; (ii) radio-communications; or (iii) value-added or resale services. (3) The Commission shall cause every notice given under subsection (2) to be published in the Gazette . (4) Notwithstanding the provisions of subsection (2), where a modification under this section is intended to remedy or prevent matters which operate or are likely to operate against the public interest, the Commission may proceed to make the proposed modification and shall inform the telecommunication operator in writing of the said modification and the reasons therefor. (5) A licensee aggrieved by the decision of the Commission under this section may appeal to the Tribunal within fifteen days from the date of receipt of the notice under subsection (2) and the Tribunal may stay the modification pending its decision on the appeal. (6) The Tribunal shall, within fifteen days of every decision of an appeal under this section, cause the decision and the reasons therefor to be published in the Gazette . [Act No. 1 of 2009 , s. 29.]"
    },
    {
      "provision_ref": "s83",
      "chapter": "Part VI",
      "section": "83",
      "title": "Register of licences",
      "content": "(1) The Commission shall maintain separate registers for the various licences issued under this Act and shall enter therein, in respect of every licence, such particulars as may be prescribed. (2) Any person may, during working hours and on payment of the prescribed fee, inspect any register of licenses: Provided that a person who is— (a) a member of the police force or a public officer acting in the course of duty; or (b) authorised in writing by the Board, may inspect the register without payment of any fee."
    },
    {
      "provision_ref": "s83A",
      "chapter": "Part VI",
      "section": "83A",
      "title": "Enforcement of licence conditions",
      "content": "(1) Where, on its own motion or consequent upon a complaint made by any person, the Commission— (a) is satisfied that a licensee is contravening or has contravened the Act, or any other written law or any of the conditions of that licence; (b) notifies the licensee in writing, specifying the acts or omissions which, in its opinion constitute or would constitute contravention of the Act or the licence; (c) requires the licensee to remedy the contravention within such period as the Commission may specify in the notice, then if the licensee fails to remedy the contravention within the prescribed period without reasonable cause, such a licensee shall be liable to a penalty of five hundred thousand shillings up to a maximum of zero decimal two per centum of the annual gross turnover of the offending licensee in the preceding year for every year or part thereof in which the offence is continuing and such penalty shall be debt owed to the Commission and recoverable summarily. (2) Notwithstanding the provisions of subsection (1), any licensee aggrieved by a decision of the Commission under this section may appeal to the tribunal within fifteen days of receipt of the notification thereof by the Commission. [Act No. 1 of 2009 , s. 30, Act No. 41A of 2013 , s. 22.] Part VIA – ELECTRONIC TRANSACTIONS [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83B",
      "chapter": "Part VIA",
      "section": "83B",
      "title": "Application",
      "content": "(1) This Part shall not apply to any rule or law requiring writing or signatures in any of the following matters— (a) the creation or execution of a will; (b) negotiable instruments; (c) deleted by Act No. 1 of 2020 , s. 14. (2) The Cabinet Secretary may by order modify the provisions of subsection (1) by adding or removing any class of transactions or matters. [Act No. 1 of 2009 , s. 31, Act No. 1 of 2020 , s. 14.]"
    },
    {
      "provision_ref": "s83C",
      "chapter": "Part VIA",
      "section": "83C",
      "title": "Functions of the Commission in relation to electronic transactions",
      "content": "(1) The functions of the Commission in relation to electronic transactions and cyber security shall be to— (a) facilitate electronic transactions by ensuring the use of reliable electronic records; (b) facilitate electronic commerce and eliminate barriers to electronic commerce such as those resulting from uncertainties over writing and signature requirements; (c) promote public confidence in the integrity and reliability of electronic records and electronic transactions; (d) foster the development of electronic commerce through the use of electronic signatures to lend authenticity and integrity to correspondence in any electronic medium; (e) promote and facilitate efficient delivery of public sector services by means of reliable electronic records; (f) develop sound frameworks to minimize the incidence of forged electronic records and fraud in electronic commerce and other electronic transactions; (g) promote and facilitate the efficient management of critical internet resources; and (h) develop a framework for facilitating the investigation and prosecution of cybercrime offences. (2) The Cabinet Secretary, in consultation with the Authority may make regulations with respect to cyber security. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 24, Act No. 25 of 2015 , Sch.]"
    },
    {
      "provision_ref": "s83D",
      "chapter": "Part VIA",
      "section": "83D",
      "title": "Requirement for a licence",
      "content": "(1) No person shall— (a) operate an electronic certification system; or (b) update a repository or administer a subdomain in the Kenya country top level domain (.ke ccTLD), except in accordance with a licence granted under this Act. (2) A person who contravenes this section commits an offence and shall be liable on conviction to a fine not exceeding three hundred thousand shillings or to imprisonment for a term not exceeding three years or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83E",
      "chapter": "Part VIA",
      "section": "83E",
      "title": "Licence for electronic certification services",
      "content": "(1) The Commission may, upon application in a prescribed manner and subject to such conditions as it may deem necessary, grant licences under this section authorizing a person to provide electronic certification services. (2) A licence granted under subsection (1) may require a licensee to— (a) make use of hardware, software and procedures that are secure from intrusion and misuse; (b) provide a reasonable level of reliability in its services which are reasonably suited to the performance of intended functions; (c) adhere to procedures that ensure that the secrecy and privacy of the electronic signatures are assured; and (d) observe such other standards as may be specified by regulations. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83F",
      "chapter": "Part VIA",
      "section": "83F",
      "title": "Licence for country code top-level domain",
      "content": "The Commission may, upon application in the prescribed manner and subject to such conditions as it may deem necessary, grant licences under this section authorizing a person to administer a subdomain in the country code top-level domain. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83G",
      "chapter": "Part VIA",
      "section": "83G",
      "title": "Legal recognition of electronic records",
      "content": "Where any law provides that information or other matter shall be in writing then, notwithstanding anything contained in such law, such requirement shall be deemed to have been satisfied if such information or matter is— (a) rendered or made available in an electronic form; and (b) accessible so as to be usable for a subsequent reference [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83H",
      "chapter": "Part VIA",
      "section": "83H",
      "title": "Retention of electronic records",
      "content": "Where any law provides that documents, records or information shall be retained for any specific period, then that requirement shall be deemed to have been satisfied where such documents, records or information are retained in electronic form if— (a) the information contained therein remains accessible so as to be usable for subsequent reference; (b) the electronic record is retained in the format in which it was originally generated, sent or received or in a format which can be demonstrated to represent accurately the information originally generated, sent or received; and (c) the details which will facilitate the identification of the original destination, date and time of dispatch or receipt of such electronic record are available in the electronic record: Provided that this clause shall not apply to any information which is automatically generated solely for the purpose of enabling an electronic record to be dispatched or received. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83I",
      "chapter": "Part VIA",
      "section": "83I",
      "title": "Retention of information in original form",
      "content": "(1) Where any law requires information to be presented or retained in its original form, that requirement is met by an electronic record if— (a) there exists a reliable assurance as to the integrity of the information from the time when it was first generated in its final for as an electronic message or otherwise; and (b) where it is required that information be presented, that information is capable of being displayed to the person to whom it is to be presented. (2) Subsection (1) applies whether the requirement therein is in the form of an obligation or whether the law simply provides consequences for the information not being presented or retained in its original form. (3) For the purposes of subsection (1)(a)— (a) the criteria for assessing integrity shall be whether the information has remained complete and unaltered, apart from the addition of any endorsement and any change which arises in the normal course of communication, storage and display; and (b) the standard of reliability required shall be assessed in the light of the purpose for which the information was generated and in light of all the relevant circumstances. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83J",
      "chapter": "Part VIA",
      "section": "83J",
      "title": "Formation and validity of contracts",
      "content": "(1) In the context of contract formation, unless otherwise agreed by the parties, an offer and acceptance of an offer may be expressed by means of electronic messages thus where an electronic message is used in the formation of a contract, the contract shall not be denied validity or enforceability solely on the ground that an electronic message was used for the purpose. (2) Nothing in this section shall apply to any law that expressly provides a different method for the formation of a valid contract. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83K",
      "chapter": "Part VIA",
      "section": "83K",
      "title": "Recognition of parties of electronic messages",
      "content": "As between the originator and the addressee of an electronic message, a declaration of intent or other statement shall not be denied legal effect, validity or enforceability solely on the ground that it is in the form of an electronic message. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83L",
      "chapter": "Part VIA",
      "section": "83L",
      "title": "Attribution of electronic records",
      "content": "(1) An electronic message shall be attributed to the originator if it was sent by the originator himself, or by a person who had the authority to act on behalf of the originator in respect of the electronic record or by an information system programmed by or on behalf of the originator to operate automatically. (2) As between an originator and an addressee, an addressee is entitled to regard an electronic message as being that of the originator, and act on that assumption, if— (a) in order to ascertain whether the electronic message was that of the originator, the addressee properly applied a procedure previously agreed to by the originator for the purpose; or (b) the electronic message as received by addressee resulted from actions of a person who had the authority to act on behalf of the originator in respect of the electronic record. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83M",
      "chapter": "Part VIA",
      "section": "83M",
      "title": "Acknowledgment of receipt",
      "content": "(1) Where the originator has not agreed with the addressee that the acknowledgement of receipt of electronic records be given in a particular form or by a particular method, an acknowledgement may be given by— (a) any communication by the addressee, automated or otherwise; (b) any conduct of the addressee, sufficient to indicate to the originator that the electronic record has been received. (2) Where the originator has stipulated that an electronic record shall be binding only on receipt of an acknowledgement of such electronic record, then, unless acknowledgement has been received, the electronic record shall be deemed to have never been sent by the originator. (3) Where the originator has not stipulated that the electronic record shall be binding on receipt of such acknowledgement, and acknowledgement has not been received by the originator within a reasonable time, then, the originator may give notice to the addressee stating that no acknowledgement has been received by him and specifying a reasonable time by which the acknowledgement must be received by him and if no acknowledgement is received within that time limit, he may, after giving notice to the addressee, treat the electronic record as though it was never sent. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83N",
      "chapter": "Part VIA",
      "section": "83N",
      "title": "Secure electronic record",
      "content": "Where any security procedure has been applied to an electronic record at a specific point of time, then such record shall be deemed to be a secure electronic record from that point of time to verification. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83O",
      "chapter": "Part VIA",
      "section": "83O",
      "title": "Compliance with requirement for a signature",
      "content": "(1) Where any law requires a signature of a person, that requirement is met in relation to an electronic message if an advanced electronic signature is used that is as reliable as was appropriate for the purpose for which the electronic message was generated or communicated, in light of all the circumstances, including any relevant agreement. (2) Subsection (I) applies whether the requirement referred to therein is in the form of an obligation or whether the law simply provides consequences for the absence of a signature. (3) An advanced electronic signature is considered to be reliable for the purpose of satisfying the requirement referred to in subsection (1) if— (a) it is generated through a signature-creation device; (b) the signature creation data are, within the context in which they are used, linked to the signatory and to no other person; (c) the signature creation data were, at the time of signing, under the control of the signatory and of no other person; (d) any alteration to the electronic signature made after the time of signing is detectable; and (e) where the purpose of the legal requirement for a signature is to provide assurance as to the integrity of the information to which it relates, any alteration made to that information after the time of signing, is detectable. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83P",
      "chapter": "Part VIA",
      "section": "83P",
      "title": "Legal recogntion of electronic signatures",
      "content": "Where any law provides that information or any other matter shall be authenticated by affixing a signature or that any document shall be signed or bear the signature of any person, then, notwithstanding anything contained in that law, such requirement shall be deemed to have been satisfied if such information is authenticated by means of an advanced electronic signature affixed in such manner as may be prescribed by the Cabinet Secretary. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83Q",
      "chapter": "Part VIA",
      "section": "83Q",
      "title": "Protected systems",
      "content": "(1) The Cabinet Secretary may, by notification in the Gazette , declare that any computer system or computer network is a protected system. (2) The Cabinet Secretary may, by order in writing, authorize any person to access protected systems notified under subsection (1). (3) Any person who secures unauthorized access or attempts to secure unauthorized access to a protected system commits an offence and is liable on conviction, to a fine not exceeding ten million shillings or to imprisonment for a term of ten years or to both. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 25.]"
    },
    {
      "provision_ref": "s83R",
      "chapter": "Part VIA",
      "section": "83R",
      "title": "Regulations for elecronic signatures",
      "content": "The Cabinet Secretary may, in consultation with the Commission, for the purposes of this Act, prescribe regulations on— (a) the type of electronic signature; (b) the manner and format in which the electronic signature shall be affixed; (c) the manner and procedure which facilitates identification of the person affixing the electronic signature; (d) control of the processes and procedures to ensure adequate integrity, security and confidentiality of electronic records or payments; and (e) any other matter which is necessary to give legal effect to electronic signatures. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83S",
      "chapter": "Part VIA",
      "section": "83S",
      "title": "Use of electronic records and electronic signatures in Government and its agencies",
      "content": "(1) Where any law provides for— (a) the effective delivery of public goods and services, improving quality of life for disadvantaged communities, strengthening good governance and public participation, creation of a better business environment, improving productivity and efficiency of government departments; (b) the filing of any form, application or any other document with any office, authority, body or agency owned or controlled by the Government in a particular manner; (c) the issue or grant of any licence, permit, sanction or approval by whatever name called in a particular manner; or (d) the receipt or payment of money in a particular manner; or then notwithstanding anything contained in such law for the time being in force, such requirement shall be deemed to have been satisfied if such filing, issue, grant, receipt or payment, as the case may be, is effected by means of such electronic forms as may be prescribed by the Cabinet Secretary in consultation with the Commission. (2) The Cabinet Secretary may, for the purposes of subsection (1), by regulations prescribe— (a) the manner and format in which such electronic records shall be filed, created or used; (b) the manner or method of payment of any fee or charges for filing, creation or issue of any electronic record under subparagraph (a). [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s83Y",
      "chapter": "Part VIA",
      "section": "83Y",
      "title": "Damaging or denying access to computer system",
      "content": "Any person who without lawful authority or lawful excuse does an act which causes directly or indirectly— (a) a degradation, failure, interruption or obstruction of the operation of a computer system; or (b) a denial of access to, or impairment of any program or data stored in, the computer system, shall commit an offence and shall, on conviction be liable to a fine not exceeding two hundred thousand shillings and or imprisonment for a term not exceeding two years or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84C",
      "chapter": "Part VIA",
      "section": "84C",
      "title": "Tampering with computer source documents",
      "content": "Any person who knowingly or intentionally conceals, destroys or alters, or intentionally or knowingly causes another person to conceal, destroy or alter any computer source code, computer programme, computer system or computer network, where the computer source code is required to be kept or maintained by law for the time being in force, shall on conviction be liable to a fine not exceeding three hundred thousand shillings or imprisonment for a term not exceeding three years, or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84D",
      "chapter": "Part VIA",
      "section": "84D",
      "title": "Publishing of obscene information in electronic form",
      "content": "Any person who publishes or transmits or causes to be published in electronic form, any material which is lascivious or appeals to the prurient interest and its effect is such as to tend to deprave and corrupt persons who are likely, having regard to all relevant circumstances, to read, see or hear the matter contained or embodied therein, shall on conviction be liable to a fine not exceeding two hundred thousand shillings or imprisonment for a term not exceeding two years, or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84E",
      "chapter": "Part VIA",
      "section": "84E",
      "title": "Publication for fraudulent purpose",
      "content": "Any person who knowingly creates, publishes or otherwise makes available an electronic signature certificate for any fraudulent or unlawful purpose commits an offence and shall on conviction be liable to a fine not exceeding one million shillings or imprisonment for a term not exceeding five years, or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84G",
      "chapter": "Part VIA",
      "section": "84G",
      "title": "Re-programming of mobile telephone",
      "content": "(1) Any person who knowingly or intentionally, not being a manufacturer of mobile telephone devices or authorized agent of such manufacturer, changes mobile telephone equipment identity, or interferes with the operation of the mobile telephone equipment identity, commits an offence. (2) A person guilty of an offence under this section shall on conviction be liable to a fine not exceeding one million shillings or to imprisonment for a term not exceeding five years or both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84H",
      "chapter": "Part VIA",
      "section": "84H",
      "title": "Possession or supply of anything for reprogramming mobile telephone",
      "content": "(1) A person commits an offence if he— (a) has in his custody or under his control anything which may be used for the purpose of changing or interfering with the operation of a mobile telephone equipment identifier; and (b) intends to use the thing unlawfully for that purpose or to allow it to be used unlawfully for that purpose; or (c) supplies anything which may be used for the purpose of changing or interfering with the operation of a mobile telephone equipment; and (d) knows or believes that the person to whom the thing is supplied intends to use it unlawfully for that purpose or to allow it to be used unlawfully for that purpose; or (e) offers to supply anything which may be used for the purpose of changing or interfering with the operation of a mobile telephone equipment identifier; and (f) knows or believes that the person to whom the thing is offered intends if it is supplied to him to use it unlawfully for that purpose or to allow it to be used unlawfully for that purpose. (2) A person guilty of an offence under this section is liable on conviction to a fine not exceeding one million shillings or to imprisonment for a term not exceeding five years or to both. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84J",
      "chapter": "Part VIB",
      "section": "84J",
      "title": "Establishment of the Fund",
      "content": "(1) There is hereby established a fund to be known as the Universal Service Fund which shall be managed and administered by the Commission. (2) The object and the purpose of the Fund shall be to support widespread access to, support capacity building and promote innovation in information and communications technology services. (3) There shall be a universal service levy (in this Part referred to as the \"levy\") that shall be charged by the Commission on the licensees under this Act For purposes of the Universal Service Fund. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84K",
      "chapter": "Part VIB",
      "section": "84K",
      "title": "Revenue and expenditure of the Fund",
      "content": "(1) There shall be credited to the Fund— (a) levies from licensees; (b) such monies as may be provided by Parliament for that purpose; (c) deleted by Act No. 41A of 2013 , s. 28; (d) income from any investment made by the Fund; and (e) any gifts, donations, grants and endowments made to the Fund. (2) There shall be paid out of the Fund any expenditure approved by the Board for the purposes of and the administration of the Fund. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 28.]"
    },
    {
      "provision_ref": "s84O",
      "chapter": "Part VIB",
      "section": "84O",
      "title": "Fund's annual returns and audit",
      "content": "The Board shall comply with the Public Audit Act ( Cap. 412B ) as regards the operations of the Fund. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84P",
      "chapter": "Part VIB",
      "section": "84P",
      "title": "Regulations with respect to the Fund",
      "content": "The Cabinet Secretary may, in consultation with the Commission, make regulations generally with respect to the administration of the Fund and without prejudice to the generality of the foregoing, with respect to— (a) amount of levy; (b) operations of the Fund; (c) mechanisms for accessing the Fund; (d) mechanisms for collection of the levy; or (e) prescribing anything that may prescribed under this Part. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 30.] Part VIC – FAIR COMPETITION AND EQUAL TREATMENT [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84Q",
      "chapter": "Part VIC",
      "section": "84Q",
      "title": "General prohibition on anti- competitive conduct",
      "content": "A licensee under this Act shall not engage in activities, which have or are intended to or likely to have the effect of unfairly preventing, restricting or distorting competition where such act or omission is done in the course of, as a result of or in connection with any business activity relating to licensed services. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84R",
      "chapter": "Part VIC",
      "section": "84R",
      "title": "Commission to ensure fair competition",
      "content": "(1) The Commission shall ensure that there is fair competition in the sector and in this regard may make a determination in the licensed system and services. (2) Without prejudice to the generality of the foregoing the Commission shall in the performance of its functions under this Act, promote, develop and enforce fair competition and equality of treatment among licensees. (3) The Cabinet Secretary may, in consultation with the Commission, make regulations for the better carrying out of the provisions under this Part. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84S",
      "chapter": "Part VIC",
      "section": "84S",
      "title": "Anti-competitive conduct",
      "content": "(1) The Commission may, on its own motion or upon complaint, investigate any licensee whom it has reason to believe or is alleged to have committed any act or omission, or to have engaged in a practice, in breach of fair competition or equal access. (2) Without limiting the generality of subsection (1) an act or omission shall include— (a) any abuse by an licensee, either independently or with others, of a dominant position; (b) entering any agreement or engaging in any concerted practice with any other party, which unfairly prevents, restricts or distorts competition or which; (i) directly or indirectly fix purchase or selling prices or any other trading conditions; (ii) limit or control production, markets, technical development or investment; (iii) share markets or sources of supply; (iv) apply dissimilar conditions to equivalent transactions with other trading parties, thereby placing them at a competitive disadvantage; (v) make the conclusion of contracts subject to acceptance by the other parties of supplementary obligations which, by their nature or according to commercial usage, have no connection with the subject of such contract. (c) the effectuation of anti-competitive conduct in the communications sector. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 31.]"
    },
    {
      "provision_ref": "s84T",
      "chapter": "Part VIC",
      "section": "84T",
      "title": "Complaints and investigation by the Commission",
      "content": "(1) The Commission may, on its own motion investigate any licensee who commits any act or omission in breach of fair competition. (2) Any person having a complaint of a breach of fair competition against a licensee shall lodge a complaint to the Commission and the Commission shall, if it appears that a breach of fair competition has been or is being committed, investigate the act and omission and give written notice to the licensee stating— (a) that the Commission is investigating a possible breach of fair competition; (b) the reasons for the suspicion of contravention or breach, including any matter of facts or law which are relevant to the investigation; (c) further information required from the licensee in order to complete the investigations; and (d) where appropriate, the steps to be taken in order to remedy breach. (3) The licensee issued with a notice under subsection (2) may, within thirty days from the date of the notice, make representations in response to the notice and give to the Commission all information required under the notice. (4) Any person affected by the contravention or breach of fair competition may similarly make representation to the Commission in relation thereto. (5) The Commission shall, after considering any representations of the licensee or any other person fix a date on which to make a decision on the matter. (6) Where the Commission makes a decision that a licensee has engaged in anti-competitive conduct, the Commission may— (a) order the licensee to stop the unfair competition; (b) require the licensee to pay a fine not exceeding the equivalent of ten percent of the annual gross turnover of the preceding year, for each financial year that the breach persists; (c) declare any anti-competitive agreement or contracts null and void; or (d) impose any other lawful remedial measure to redress this offence. (7) The provisions of subsection (6) shall not in any way affect the right of any person to make and sustain any claim under any law in force in Kenya for the act or omission which constitutes an offence under this Act or from being liable under that other written law to any punishment or penalty higher than that prescribed under this Act. (8) Any person aggrieved by the decision of the Commission under this section may appeal to the Tribunal. (9) The provisions of this section, shall not limit or in any way affect the obligations of a licensee under any condition of a licence. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 32.]"
    },
    {
      "provision_ref": "s84U",
      "chapter": "Part VIC",
      "section": "84U",
      "title": "Denial of access",
      "content": "No licensee under this Act shall deny access or service to a customer except for delinquency of payment of dues or for any other just cause. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84V",
      "chapter": "Part VIC",
      "section": "84V",
      "title": "Anti-competitive practices and conduct",
      "content": "A licensee shall provide equal opportunity for access to the same type and quality of service to all customers in a given area at substantially the same tariff limiting variations to available or appropriate technologies required to serve specific customers. [Act No. 1 of 2009 , s. 31.]"
    },
    {
      "provision_ref": "s84W",
      "chapter": "Part VIC",
      "section": "84W",
      "title": "Regulations on competition issues",
      "content": "(1) The Cabinet Secretary may in consultation with the Commission make regulations with respect to competition issues. (2) Without prejudice to the generality of the foregoing, the Cabinet Secretary in consultation with the Commission may make regulations with respect to— (a) access, including rules of interconnection, by licensees under this Act and their subscribers to each other's network; (b) the procedure of handling alleged breaches of fair competition; (c) investigation of a licensee under this Act alleged to have committed acts or omissions in breach of fair competition; (d) access to information from any licensee with regard to facilitating investigations on alleged breaches of fair competition; (e) steps to be taken in order to remedy the breach; (f) definition of market segments; (g) account separation. (3) A dominant telecommunications service provider shall file tariffs, rates, terms, and conditions of interconnection with the Commission. (4) The Commission may, in consultation with the Competition Authority and after due process declare a person or institution, by notice in the Gazette , to be a \"dominant telecommunications Service provider\" for the purposes of this Act. (5) In making a declaration under subsection (4), the Commission shall in consultation with the Competition Authority consider— (a) the market share of the telecommunications service provider being at least twenty five per cent of the total revenue of the entire telecommunications market; (b) significant market power enjoyed by the telecommunications service provider; and (c) any other consideration the Authority may determine. (d) deleted by Act No. 41A of 2013 , s. 33. [Act No. 1 of 2009 , s. 31, Act No. 41A of 2013 , s. 33, Act No. 25 of 2015 , Sch.] Part VII – MISCELLANEOUS PROVISIONS"
    },
    {
      "provision_ref": "s84",
      "chapter": "Part VII",
      "section": "84",
      "title": "National Communication Secretariat",
      "content": "(1) There is established a Secretariat to be known as the National Communication Secretariat, headed by a Communications secretary and comprising such other officials as may be determined from time to time. (2) The function of the Secretariat shall be to advise the Government on the adoption of a communication policy which— (a) promotes the benefits of technological development to all users of postal and telecommunication facilities; (b) fosters national safety and security, economic prosperity and the delivery of critical social services through posts and telecommunications; (c) facilitates and contributes to the full development of competition and efficiency in the provision of services both within and outside Kenya; and (d) fosters full and efficient use of telecommunication resources including effective use of the radio spectrum by the Government in a manner which encourages the most beneficial use thereof in the public interest."
    },
    {
      "provision_ref": "s85",
      "chapter": "Part VII",
      "section": "85",
      "title": "Power of operator to use land",
      "content": "(1) Subject to subsection (3), a telecommunication operator may, with the consent in writing of the owner or occupier of any land, and subject to such terms and conditions as may be agreed upon between the operator and the owner or occupier, place or maintain under, over, along, across, in or upon such land, any telecommunication apparatus or such radio-communication apparatus, installed or used in accordance with a radio-communication licence. (2) Upon an agreement under subsection (1), it shall be lawful for the telecommunication operator or its representatives, at all times and on reasonable notice, to enter upon the land and to— (a) put up any posts, which may be required for support of any telecommunication lines; (b) fasten or attach to any tree growing on that land a bracket or other support for the line; (c) cut down any tree or branch which is likely to injure, impede or interfere with any telecommunication lines; or (d) perform any activities necessary for the purpose of establishing, constructing, repairing, improving, examining, altering or removing any telecommunication apparatus or radio communication apparatus, or for performing any other activities in accordance with the provisions of this Act. (3) Notwithstanding any agreement under subsection (1) a telecommunication operator shall not, except with the consent of the owner or occupier of the land— (a) acquire any right other than that of user of such land under, over, along, across, in or upon which any telecommunication apparatus or radio communication apparatus is placed and only for such purposes as the parties have agreed; (b) exercise those powers in respect of any land vested in or under the control of a local authority, except in accordance with a procedure set out in section 86 . (4) A telecommunication operator shall ensure that as little damage as possible is caused to the land and to the environment by reason of the exercise of the powers conferred by this section and shall pay fair and adequate compensation to the owner or occupier of the land for any damage or loss sustained by reason thereof. (5) Any dispute arising between an operator and the owner or occupier of any land with respect to the provisions of this section may be referred to the Tribunal for adjudication within thirty days of the dispute."
    },
    {
      "provision_ref": "s85A",
      "chapter": "Part VII",
      "section": "85A",
      "title": "Co-location",
      "content": "(1) Co-location at sites and facilities may be done with prior agreement of licenses. (2) When no agreement on co-location is reached, the licensees may refer the issue to the Commission for a decision. (3) The Cabinet Secretary, in consultation with the Authority may make regulations with respect to infrastructure sharing. [Act No. 1 of 2009 , s. 32, Act No. 41A of 2013 , s. 34, Act No. 25 of 2015 , Sch.]"
    },
    {
      "provision_ref": "s86",
      "chapter": "Part VII",
      "section": "86",
      "title": "Procedure for using public land",
      "content": "(1) Where a telecommunication operator licensed by the Commission intends to enter any land under the control of a local authority or other public body, the telecommunication operator shall seek the consent of the local authority or public body, stating the nature and extent of the acts to be done. (2) The local authority or other public body may, upon request under subsection (1), permit the telecommunication operator to exercise any or all of the powers under section 85 (2), subject to such conditions, including the payment of any fee for the use of the property, the time or mode of execution of any works, or for any other related activity undertaken by the telecommunication operator under the section as may be agreed between the telecommunication operator and the authority. (3) An operator dissatisfied with the terms or conditions imposed by the local authority under subsection (1), may apply to the Commission for the review of such terms or conditions. (4) A person aggrieved by the decision of the Commission under subsection (3) may appeal to the Tribunal within thirty days of such decision."
    },
    {
      "provision_ref": "s87",
      "chapter": "Part VII",
      "section": "87",
      "title": "Compulsory purchase of land",
      "content": "(1) Where, upon application by a telecommunication operator, the Commission considers that it is necessary land for the purpose of providing telecommunication services to the public, the Commission may apply to the Commissioner of Lands to acquire the land on behalf of the telecommunication operator. (2) Upon application by the Commission under subsection (1), the Commissioner of Lands may, if satisfied that it is in the public interest to do so, acquire the land in accordance with the provisions of the Land Acquisition Act ( Cap. 301 ). (3) Where land is acquired on behalf of a telecommunication operator under subsection (2), such operator shall bear all costs in relation thereto."
    },
    {
      "provision_ref": "s89",
      "chapter": "Part VII",
      "section": "89",
      "title": "Entry and search of premises, etc.",
      "content": "(1) If a court is satisfied by information on oath that there is reasonable ground for suspecting that an offence under the provisions of this Act has been or is being committed, and that the evidence of the commission of the offence is to be found on any premises specified in the information, or in any vehicle, vessel or aircraft so specified, it may grant a search warrant, authorising any person or persons authorised in that behalf by the Commission and named in the warrant, with any police officer, to enter, at any time within one month from the date of the warrant, the premises specified in the information or, as the case may be, the vehicle, vessel or aircraft so specified and to search such premises, vehicle, vessel or aircraft, and to examine and test any station or apparatus or obtain any article or thing found in such premises, vessel, vehicle or aircraft. (2) If a court is satisfied that— (a) it is necessary to enter any specified premises, vessel, aircraft or vehicle, for the purpose of obtaining such information which will enable the Commission to gather necessary evidence in accordance with the provision of subsection (1); (b) access to such premises, vessel, aircraft or vehicle for the purpose of obtaining such evidence as aforesaid has, within seven days before the date of the application to the court, been sought by a person duly authorised in that behalf by the Commission and has been denied, the court may grant written authorisation under its hand and seal empowering any person or persons authorised in that behalf by the Commission and named in the authorisation, with any police officer, to enter and search the premises or as the case may be, the vessel, aircraft or vehicle with a view to discovering whether any station, apparatus, article or thing as aforesaid is situate thereon, and to examine and test it with a view to obtaining such information as aforesaid: Provided that an authorisation shall not be issued under this subsection unless either— (i) it is shown to the court that the Commission is satisfied that there are reasonable grounds for believing that the use of the station or apparatus in question is likely to cause undue interference with any radio-communication used for the purposes of any safety-of life-service or any purpose on which the safety of any person or of any vessel, aircraft or vehicle may depend; or (ii) it is shown to the court that not less than seven days’ notice of the demand for access was served on the owner or occupier of the premises, or the person in possession or in charge of the vessel, aircraft or vehicle, and that the demand was made at a reasonable hour and was unreasonably denied. (3) Where under this section a person is authorised to examine and test any telecommunication system or telecommunication apparatus or radio-communication apparatus on any premises or in any vessel, aircraft or vehicle, it shall be the duty of any person who is on the premises, or is in charge of, or in attendance on, the vessel, aircraft or vehicle, to give such authorised person such assistance as he may reasonably require in the examination or testing of such station or such apparatus. (4) Any person who— (a) obstructs any authorised person in the exercise of the powers conferred on him under this section; or (b) fails or refuses to give to any such authorised person any assistance which he is, under this section, under a duty to give to him; or (c) discloses, otherwise than for the purpose of this Act or any report of proceedings thereunder, any information by means of the exercise of powers under this Act, being information with regard to any manufacturing process or trade secret, commits an offence and shall be liable on conviction to a fine not exceeding five hundred thousand shillings, or to imprisonment for a term not exceeding three years, or to both. (5) For purposes of this section “court” means a Resident Magistrate’s Court."
    },
    {
      "provision_ref": "s90",
      "chapter": "Part VII",
      "section": "90",
      "title": "Seizure of apparatus, article or other property",
      "content": "(1) A search warrant granted under section 89 may authorise the person or persons named in it to seize and detain, for the purposes of any relevant proceedings, any radio-communication apparatus, telecommunication apparatus, article or other thing found in the course of the search carried out in pursuance of the warrant which appears to have been used in connection with or to be evidence of the commission of any offence under this Act. (2) If a police officer or any person authorised by a warrant to exercise the power conferred under this section has reasonable grounds to suspect that an offence under this Act has been or is being committed, he may seize and detain, for the purposes of any relevant proceedings, any radio-communication apparatus, telecommunication apparatus article or other thing which appears to have been used in connection with or to be evidence of the commission of any such offence. (3) Nothing in this section shall prejudice any power to seize or detain property which is exercisable by a police officer under the Police Act ( Cap. 84 ). (4) Any person who intentionally obstructs the authorised person in the exercise of the power conferred on him under subsection (2) commits an offence and shall be liable on conviction to a fine not exceeding one hundred thousand shillings, or to imprisonment for a term not exceeding one year, or to both. [Act No. 41A of 2013 , s. 35.]"
    },
    {
      "provision_ref": "s91",
      "chapter": "Part VII",
      "section": "91",
      "title": "Forfeiture of property used in commission of offence",
      "content": "(1) Where a person is convicted of an offence under this Act for the contravening of any of the provisions relating to any radio communication station or telecommunication system, or any radio-communication apparatus, or any telecommunication apparatus, or in the use of any apparatus for the purpose of interfering with any radio-communication or telecommunication, or uses any article or property for disrupting the postal services in contravention of any of the provisions of this Act, the court may, in addition to any other penalty, order all or any of the apparatus of the telecommunication system, the radio-communication station or any such other apparatus, or article or property in connection with which the offence was committed, to be forfeited to the commission: Provided that the provisions of this subsection shall not apply to radio communication apparatus not designed or adapted for transmission (as opposed to reception). (2) The court by which any such apparatus, article or property is ordered to be forfeited under this section may also order the person, by whom the offence giving rise to the forfeiture was committed, not to dispose of that apparatus, article or property except by delivering it to the Commission within such period as the court may deem fit. (3) If a person against whom an order is made under subsection (2) contravenes that order or fails to deliver such apparatus, article or property to the commission as required, he shall be guilty of a further offence which, for the purpose of determining the appropriate penalty shall be treated as an offence under the same provision as the offence for which the forfeiture was ordered."
    },
    {
      "provision_ref": "s93",
      "chapter": "Part VII",
      "section": "93",
      "title": "Access to information",
      "content": "Access to information and restrictions on disclosure of information held by the Authority shall be implemented pursuant to Article 35 of the Constitution. [Act No. 41A of 2013 , s. 36.]"
    },
    {
      "provision_ref": "s94",
      "chapter": "Part VII",
      "section": "94",
      "title": "Powers in relation to electricity undertakers, etc.",
      "content": "(1) Subject to subsection (7), any person who establishes or operates, under any written law or otherwise, any undertaking for the supply of electricity (in this section referred to as “the undertaker”) or any person who constructs, equips or operates a railway by means of electricity (in this section referred to as “the railway operator”) shall, at least one month before erecting, placing or altering the position of any line or wire for the transmission of such electricity, forward to the telecommunication operator within the area within which such work is to be executed, or to the public postal licensee where any post office or other property is likely to be affected a notice in writing of his intention to execute such work together with a plan of the proposed work, and the undertaker or the railway operator shall also give to the telecommunication operator, or as the case may be, the public postal licensee all such other information as he may require in order to determine whether such work is likely to interfere unduly with any telecommunication or postal services. (2) Where an undertaker has given notice in writing in accordance with subsection (1), the telecommunication operator, or as the case may be, the public postal licensee within one month of the receipt of such notice, shall inform the undertaker in writing that the proposed work has either been approved or that, in accordance with subsection (3), certain requirements are considered necessary to be effected or that the matter referred to in the notice is receiving attention, and in the event of no such notification in writing being so given, the position of any electric supply line specified in the notice given in accordance with subsection (1) shall, for the purposes of this Act, be deemed to have been approved in writing. (3) If the telecommunication operator, or as the case may be, the public postal licensee considers that any such work is likely to interfere unduly with any telecommunication or postal services provided by or under the authority of the Commission, he may inform the undertaker or the railway operator of any requirements he may consider necessary to be effected by the undertaker or the railway operator in order to remove or lessen such anticipated interference, and in so doing he shall have regard not only to the interests of such telecommunication or postal services, but also to the interests of all persons supplied or who may be supplied with electricity by the undertaker and of all persons using the facilities provided by the railway operator. (4) If the undertaker or the railway operator does not agree to effect such requirements, or any altered requirements communicated to him under subsection (3) the matter shall be referred to the Cabinet Secretary for the time being responsible for Public Lands, and the undertaker or the railway operator shall not proceed with the execution of such work until that Cabinet Secretary has given his decision thereon. (5) Where any matter has been referred to the Cabinet Secretary for the time being responsible for public lands under this section, that Cabinet Secretary may appoint any person or committee to investigate the matter and to report thereon to him. (6) After consideration of the report of any such person or committee, the Cabinet Secretary responsible for public lands may, after giving the parties reasonable opportunity of being heard, give such decision as he may think fit, and may specify what requirements, if any, the undertaker or the railway operator shall comply with in executing any such work and any such decision shall be final. (7) The Commission may, by notice in the Gazette , specify general requirements to be observed by any undertaker or railway operator when erecting, placing or altering the position of any electric supply line, and in any such notice the Commission may provide that it shall not be necessary— (a) for any undertaker or railway operator effecting any specified class of work; or (b) for any specified class of undertaker or railway operator, to give to the telecommunication operator, or the public postal licensee notice referred to in subsection (1) if, in effecting any work, any such undertaker or railway operator proposes to comply with such general requirements."
    },
    {
      "provision_ref": "s95",
      "chapter": "Part VII",
      "section": "95",
      "title": "Structures likely to interfere with telecommunication or postal services",
      "content": "Where any person erects any building or structure which is likely to cause interference with the telecommunication, or radio communication or postal services, the telecommunication operator or, as the case may be, the public postal licensee may, unless such person has previously obtained the approval in writing of such operator or licensee to the erection of such building or structure or has modified it to the satisfaction of the said operator or licensee, require such person to pay to the said operator or the licensee the amount of any expenditure necessarily incurred by him in the removal of any installation, apparatus or equipment in order not to interfere with telecommunication, radio communication or postal services."
    },
    {
      "provision_ref": "s96",
      "chapter": "Part VII",
      "section": "96",
      "title": "Offences by companies",
      "content": "(1) Where any offence under this Act has been committed by a company or body corporate, every person who at the time of the commission of the offence was a director, general manager, company secretary or other similar officer of such company or body corporate, or was purporting to act in any such capacity, shall be deemed also to be guilty of that offence, unless he proves that the offence was committed without his consent or connivance and that he exercised all such diligence to prevent the commission of the offence as he ought to have exercised having regard to the nature of his functions in that capacity and to all the circumstances. (2) Where a person is convicted of an offence under this Act in relation to the unlawful use of any telecommunication system or radio communication apparatus, or to the use of any apparatus or property for the purpose of interfering with any telecommunication, radio communication or postal services, the court may, in addition to any other penalty, order all or any of the apparatus or property with which the offence was committed to be forfeited to the Commission. (3) Where the affairs of the company or body corporate are managed by its members, subsection (1) shall apply in relation to the acts and defaults of a member in connection with his functions of management as if he were a director of that company or body corporate."
    },
    {
      "provision_ref": "s97",
      "chapter": "Part VII",
      "section": "97",
      "title": "Property of the Commission in the custody of employee.",
      "content": "(1) Where any employee of the Commission dies or leaves the service of the Commission and at the time of such death or termination of service any premises of the Commission were occupied by him or any property of the Commission was in his possession, it shall be the duty of such employee or, in the event of his death, of the person in whose possession such property may be or who may be occupying such premises, as soon as practicable, to deliver such property to the Commission or to vacate such premises. (2) If any property or premises to which subsection (1) refers, is not delivered to the Commission or vacated, the Director-General shall give notice in writing to the person appearing to him to be in possession of such property or in occupation of such premises to deliver to the Commission such property or vacate such premises within such time as may be specified in the notice and if such property is not so delivered or such premises are not so vacated within such time, the Director-General may, without prejudice to any other means of recovery, apply to a Resident Magistrate for an order empowering a police officer to enter and search any house or building where such property is believed to be and to deliver such property, if found, to the Commission or, as the case may require, to evict from such premises any person found therein."
    },
    {
      "provision_ref": "s98",
      "chapter": "Part VII",
      "section": "98",
      "title": "Limitation",
      "content": "Where any action or other legal proceeding is commenced against the Commission for any act done in pursuance or execution, or intended execution of this Act or of any public duty or authority, or in respect of any alleged neglect or default in the execution of this Act or of any such duty or authority, the following provisions shall have effect— (a) the action or legal proceeding shall not be commenced against the Commission until at least one month after written notice containing the particulars of the claim, and of intention to commence the action or legal proceedings, has been served upon the Director-General by the plaintiff or his agent; (b) the action or legal proceeding shall not lie or be instituted unless it is commenced within twelve months of the act, neglect or default complained of or, in the case of a continuing injury or damage, within six months next after the cessation thereof."
    },
    {
      "provision_ref": "s99",
      "chapter": "Part VII",
      "section": "99",
      "title": "Restriction on execution against property of Commission",
      "content": "Notwithstanding anything to the contrary in any law— (a) where any judgement or order has been obtained against the Commission no execution or attachment, or process in the nature thereof, shall be issued against the Commission or against any property of the Commission, but the Director-General shall, without delay, cause to be paid out of the revenue of the Commission such amounts as may, by the judgement or order, be awarded against the Commission to the person entitled thereto; (b) no property of the Commission shall be seized or taken by any person having by law power to attach or restrain property without the previous written permission of the Director-General."
    },
    {
      "provision_ref": "s100",
      "chapter": "Part VII",
      "section": "100",
      "title": "Service of notice, etc., on Director-General",
      "content": "Any notice or other document required or authorised under this Act to be served on the Commission may be served— (a) by delivering of the notice or other document to the Director-General or to any other authorised employee of the Commission; or (b) by leaving it at the office of the Director-General; or (c) by sending it by registered post to the Director-General."
    },
    {
      "provision_ref": "s101",
      "chapter": "Part VII",
      "section": "101",
      "title": "Service of notice, etc., by Director-General",
      "content": "Any notice or other document required or authorised under this Act to be served on any person by the Commission or the Director-General or any employee may be served— (a) by delivering it to that person; or (b) by leaving it at the usual or last known place of abode of that person; or (c) by sending it by registered post addressed to that person at his usual or last known address."
    },
    {
      "provision_ref": "s102",
      "chapter": "Part VII",
      "section": "102",
      "title": "Establishment  of the Communications and Multimedia Appeals Tribunal",
      "content": "(1) There is established a Tribunal to be known as the Communications and Multimedia Appeals Tribunal (hereinafter referred to as \"the Tribunal\") which shall consist of not more than seven members, as follows— (a) a Chairperson nominated by the Judicial Service Commission, who shall be a person qualified for appointment as a judge of the High Court of Kenya and who shall also possess experience in communication policy and law; (b) at least four persons possessing knowledge and experience in media, telecommunication, postal, courier systems, radio communications, information technology or business practice and finance, and who are not in the employment of the Government, the Media Council or the Authority. (2) Within fourteen days of the commencement of this Act, or of the occurrence of a vacancy in the office of a member of the Tribunal, the Cabinet Secretary shall— (a) by notice in the Gazette and in at least two newspapers of national circulation, declare vacancies in the Tribunal, and invite applications from qualified persons; and (b) convene a selection panel for the purpose of selecting suitable candidates for appointment as members of the Tribunal. (3) The selection panel referred to under subsection (2) shall comprise of persons drawn from the following organisations— (a) Media Council of Kenya; (b) Kenya Private Sector Alliance; (c) Law Society of Kenya; (d) Institute of Engineers of Kenya; (e) Public Relations Society of Kenya; (f) Kenya National Union of Teachers; (g) Consumers Federation of Kenya; and (h) The Ministry responsible for matters relating to media. (4) At its first meeting, the selection panel shall appoint a Chairperson and a vice-Chairperson who shall be of opposite gender. (5) An application in respect of a vacancy declared under subsection (2) shall be forwarded to the selection panel within seven days of the publication of the notice. (6) The selection panel shall, subject to this section, determine its own procedure and the Cabinet Secretary shall provide it with such facilities and other support as it may require for the discharge of its functions under this section. (7) The selection panel shall consider the applications, shortlist and publish the names and qualifications of all the applicants and those shortlisted by the panel in the Gazette and in at least two daily newspapers of national circulation, within seven days from the expiry of the deadline of receipt of applications under subsection (5). (8) The selection panel shall interview the shortlisted applicants within fourteen days from the date of publication of the list of short listed applicants under subsection (7). (9) After carrying out the interviews, the selection panel shall select three persons qualified to be appointed as members of the Tribunal, for each vacant position, and forward the names to the Cabinet Secretary. (10) The Cabinet Secretary, shall, within seven days of receipt of the names, by notice in the Gazette , appoint a member or members to the Tribunal. (11) Upon receipt of the notice of rejection under subsection (11), the selection panel shall submit fresh nominations and the procedure set out under this section shall, with necessary modifications, apply. (12) Despite the foregoing provisions of this section, the Cabinet Secretary may, by notice in the Gazette , extend the period specified in respect of any matter under this section by a period not exceeding fourteen days. (13) In selecting, nominating, approving or appointing the members of the Tribunal, the selection panel and the Cabinet Secretary shall— (a) ensure that the nominees to the Tribunal reflect the interests of all sections of the society; (b) ensure equal opportunities for persons with disabilities and other marginalized groups; and (c) ensure that not more than two-thirds of the members shall be of the same gender. (14) The selection panel shall stand dissolved upon the appointment of the members of the Tribunal. (15) The members of the Tribunal shall hold office for a period of three years, but shall be eligible for reappointment for one further term for a period not exceeding three years. (16) The office of a member of the Tribunal shall become vacant— (a) at the expiration of three years from the date of appointment; (b) if the member accepts any office the holding of which, if he or she were not a member of the Tribunal, would make him or her ineligible, for appointment to the office of a member of the Tribunal; (c) if he or she is removed from the membership of the Tribunal by the Cabinet Secretary on the recommendation of a tribunal set up for that purpose under subsection (17); and (d) if he or she resigns the office of member of the Tribunal. (17) A person desiring the removal of a member of the Tribunal on the ground specified in subsection (16)(c) may present a complaint under oath to the Cabinet Secretary setting out the alleged facts constituting that ground. (18) The Cabinet Secretary shall consider the complaint and, if satisfied that it discloses a ground under subsection (16)(c)— (a) may suspend the member pending the outcome of the complaint; and (b) shall appoint a tribunal in accordance with subsection (19). (19) The tribunal appointed under subsection (18) shall consist of— (a) a person who holds or has held office as a Judge of a superior court, who shall be the Chairperson; (b) at least two persons who are qualified to be appointed as Judge of the High Court; and (c) one other member who is qualified to assess the facts in respect of the particular ground for removal. (20) The tribunal shall investigate the matter expeditiously, report on the facts and make a recommendation to the Cabinet Secretary, who shall act in accordance with the recommendation within thirty days. [Act No. 1 of 2009 , s. 33, Act No. 6 of 2009 , Sch., Act No. 41A of 2013 , ss. 2(2) & 37.]"
    },
    {
      "provision_ref": "s102A",
      "chapter": "Part VII",
      "section": "102A",
      "title": "Complaints",
      "content": "(1) A person aggrieved by— (a) any publication by or conduct of a journalist or media enterprise; (b) anything done against a journalist or media enterprise that limits or interferes with the constitutional freedom of expression of such journalist or media enterprise; or (c) any action taken, any omission made or any decision made by any person under this Act, may make a written complaint to the Tribunal setting out the grounds for the complaint, nature of the injury or damage suffered and the remedy sought. (2) A complaint under this section may be made— (a) orally, either in person or by any form of electronic communication; or (b) in writing, setting out the ground for the complaint, nature of the injury or damage suffered and the remedy sought. (3) Where complaints are oral, the Tribunal may require them to be reduced in writing within seven days, unless it is satisfied there are good reasons for not doing so. (4) A complainant shall disclose to the Tribunal— (a) the complainant's name and address; and (b) other information relating to the complainant's identity that the Tribunal may reasonably require. (5) Despite subsection (4), the Tribunal may— (a) keep information provided by a complainant confidential if there are special circumstances to do so, or the Tribunal considers it is in the complainant's interests to do so; or (b) accept an anonymous complaint concerning an issue of public interest or where no clearly identifiable person or group is affected. (6) The Tribunal may require a complainant to provide more information about the complaint within such reasonable time as the Tribunal may determine. (7) The Tribunal may, at any time, require a complaint or information provided by a complainant to be verified by the complainant by oath or statutory declaration. (8) Without prejudice to the functions of the Authority or the Media Council, the Authority or the Council may take up a complaint on its own initiative, and forward the same to the Tribunal for determination where in its opinion the complaint has public interest implications. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102B",
      "chapter": "Part VII",
      "section": "102B",
      "title": "Procedure upon complaint",
      "content": "(1) Upon receipt of a complaint, the Tribunal shall notify, in writing, the party against whom the complaint has been made, within fourteen-days of receipt of the complaint, stating the nature of the complaint, the breach, act or omission complained of and the date on which the matter shall be considered by the Tribunal. (2) The notice referred to in subsection (1) shall require the person against whom the complaint is made to respond to the complaint in writing or appear before it at the hearing of the complaint. (3) After considering each party's submissions, the Tribunal shall then conduct a preliminary assessment to determine the admissibility or otherwise of the complaint lodged within fourteen days. (4) The Tribunal or any of its panels may, after conducting a preliminary assessment of a complaint, and being of the opinion that the complaint is devoid of merit or substance, dismiss such complaint and give reasons thereto. (5) A party may, within fourteen days from the date of dismissal, apply for review or variation of the Tribunal's decision under subsection (4). [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102C",
      "chapter": "Part VII",
      "section": "102C",
      "title": "Proceedings by the Tribunal",
      "content": "(1) The Tribunal shall sit at such times and in such places as it may appoint. (2) The proceedings of the Tribunal shall be open to the public save where the Tribunal, for good cause, otherwise directs. (3) For purposes of hearing and determining any cause or matter under this Act or the Media Council Act ( Cap. 411B ), the chairperson and four members of the Tribunal shall form a quorum. (4) A member of the Tribunal who has a direct interest in any matter which is the subject of the proceedings before the Tribunal shall not take part in those proceedings. (5) Any person who is a party to proceedings before the Tribunal may appear in person or be represented by an Advocate before the Tribunal. (6) Except as expressly provided in this Act, the Media Council Act ( Cap. 411B ), or any regulations made thereunder, the Tribunal shall regulate its own procedure. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102D",
      "chapter": "Part VII",
      "section": "102D",
      "title": "Attendance before the Tribunal",
      "content": "(1) The Tribunal may— (a) make such orders for the purposes of securing the attendance of any person at any place where the Tribunal is sitting, discovery or production of any document concerning a matter before the Tribunal or the investigation of any contravention of this Act or the Media Cotincil Act, as it deems necessary or expedient; (b) take evidence on oath and may for that purpose administer oaths; or (c) on its own motion summon and hear any person as witness. (2) Any person who— (a) fails to attend the Tribunal after having been required to do so under subsection (1)(a); (b) refuses to take oath or affirmation before the Tribunal or, being a public officer refuses to produce any article or document when lawfully required to do so by the Tribunal; (c) knowingly gives false evidence or information which he knows to be misleading before the Tribunal; or (d) at any sitting of the Tribunal— (i) wilfully insults any member or officer of the Tribunal; (ii) wilfully interrupts the proceedings or commits any contempt of the Tribunal; (iii) fails or neglects to comply with an award, decision, order, direction or notice confirmed by the Tribunal commits an offence under this Act; (e) fails or neglects to comply with an award, decision, order, direction or notice confirmed by the Tribunal commits an offence under this Act. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102E",
      "chapter": "Part VII",
      "section": "102E",
      "title": "Decisions of the Tribunal",
      "content": "(1) The Tribunal may, after hearing the parties to a complaint— (a) order the offending party to publish an apology and correction in such manner as the Tribunal may specify; (b) order the return, repair, or replacement of any equipment or material confiscated or destroyed; (c) make any directive and declaration on freedom of expression; (d) issue a public reprimand of the journalist or media enterprise involved; (e) order the offending editor of the broadcast, print or on-line material to publish the Tribunal's decision, in such manner as the Tribunal may specify; (f) impose a fine of not more than twenty million shillings on any respondent media enterprise and a fine of not more than five hundred thousand shillings on any journalist adjudged to have violated this Act; (g) in its reasons for its findings, record a criticism of the conduct of the complainant in relation of the complaint, where such criticism, is in its view, warranted; (h) recommend the suspension or removal from the register of the journalist involved; (i) make any supplementary or ancillary orders or directions that it may consider necessary for carrying into effect orders or directives made. (2) The Tribunal may make any or a combination of the orders set out in subsection (1). [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102F",
      "chapter": "Part VII",
      "section": "102F",
      "title": "Appeals to the Tribunal",
      "content": "(1) Unless otherwise expressly provided in this Act, the Media Council Act ( Cap. 411B ) or any other law, where this Act or the Media Council Act ( Cap. 411B ), empowers the Media Council or the Authority to make decisions, such decisions may be subject to an appeal to the Tribunal in accordance with such procedures as may be established by the Tribunal for that purpose. (2) Any person who is aggrieved by an action or decision of the Media Council, the Authority or a person licensed under this Act, may within sixty days after the occurrence of the event or the making of the decision, against which he is dissatisfied, make a claim or appeal to the Tribunal. (3) Upon any appeal, the Tribunal may— (a) confirm, set aside or vary the order or decision in question; (b) exercise any of the powers which could have been exercised by the Media Council or the Authority in the proceedings in connection with which the appeal is brought; or (c) make such other order, including an order for costs, as it may consider necessary. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102G",
      "chapter": "Part VII",
      "section": "102G",
      "title": "Appeals from the decision of the Tribunal",
      "content": "(1) Any person aggrieved by a decision or order of the Tribunal may, within thirty days of such decision or order, appeal against such decision or order to the High Court. (2) No decision or order of the Tribunal shall be enforced until the time for lodging an appeal has expired or, where the appeal has been commenced until the appeal has been determined. (3) The decision of the High Court on any appeal under this section shall be final. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102H",
      "chapter": "Part VII",
      "section": "102H",
      "title": "Assessors",
      "content": "The chairperson of the Tribunal may appoint any persons with special skills or expert knowledge on any issues which are the subject matter of any proceedings or inquiry before the Tribunal to act as assessors in an advisory capacity, in any case where it appears to the Tribunal that such special skills or knowledge are required for proper determination of the matter. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102I",
      "chapter": "Part VII",
      "section": "102I",
      "title": "Remuneration of members of the Tribunal",
      "content": "The chairperson and members of the Tribunal shall be paid such allowances as the Salaries and Remuneration Commission may determine. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102J",
      "chapter": "Part VII",
      "section": "102J",
      "title": "Liability of Tribunal members",
      "content": "The chairperson or other members of the Tribunal shall not be liable to be sued in a civil court for an act done or omitted to be done or ordered to be done by them in the discharge of their duty as members of the Tribunal, whether or not within the limits of their jurisdiction, provided they, at the time, in good faith, believed themselves to have jurisdiction to do or order the act complained of, and no officer of the Tribunal or other person bound to execute the lawful warrants, orders or other process of the Tribunal shall be liable to be sued in any court for the execution of a warrant, order or process which he would have been bound to execute if within the jurisdiction of the Tribunal. [Act No. 41A of 2013 , s. 37.]"
    },
    {
      "provision_ref": "s102K",
      "chapter": "Part VII",
      "section": "102K",
      "title": "Universal Service Advisory Council",
      "content": "(1) There is established a Council to be known as the Universal Service Advisory Council. (2) Deleted by Act No. 41A of 2013 , s. 39. (3) The Council may, upon approval by the Board, co-opt experts as it considers necessary. (4) In appointing members of the Council under subsection (2), the Cabinet Secretary shall have regard to appoint persons who— (a) have knowledge or experience in broadcasting, telecommunication, postal systems, information technology or finance or any other relavant field; (b) have satisfied the Cabinet Secretary that they are unlikely to have a conflict of interest under this Act and will not have any financial or other interest which will be likely prejudicially affect the carrying out of any functions under this Part; Provided that an authorization shall not be issued under this subsection unless it is shown to the court that the Commission is satisfied that there are reasonable grounds for believing that the use of the station or apparatus in question is likely to cause undue interference with any radiocommunication used for the purposes of any safety-of life-service or any purpose on which the safety of any person or of any vessel, aircraft or vehicle may depend; or (5) The Universal Service Advisory Council shall— (a) advise the Authority and provide strategic policy guidance for the administration and implementation of the Universal Service Fund; and (b) perform any other functions as the Board, may from time to time assign. (6) The Council shall consist of a chairperson and eight other members appointed by the Cabinet Secretary in accordance with this section. (7) Within, fourteen days of the occurrence of a vacancy in the office of chairperson or member, the Public Service Commission shall, by notice in the Gazette and on the official website of the Public Service Commission, declare vacancies in the Council, and invite applications from qualified persons. (8) An application in respect of a vacancy declared under subsection (7) shall be forwarded to the Public Service Commission within seven days of the publication of the notice and may be made by— (a) any qualified person; or (b) any person, organisation or group of persons proposing the nomination of any qualified person. (9) The Public Service Commission shall consider the applications, shortlist and publish the names and qualifications of all the applicants and shortlisted applicants in the Gazette and on the official website of the Commission, within seven days from the expiry of the deadline of receipt of applications under subsection (8). (10) The Public Service Commission shall interview the shortlisted applicants within fourteen days from the date of publication of the list of shortlisted applicants under subsection (9). (11) Upon carrying out the interviews, the Public Service Commission shall select three persons qualified to be appointed as chairperson and sixteen persons qualified to be appointed as members of the Council, and shall forward the names to the Cabinet Secretary. (12) The Cabinet Secretary shall, within fourteen days of receipt of the names under subsection (11), appoint the chairperson and the members of the Council. (13) In selecting, shortlisting and appointing the chairperson and members of the Council, the Cabinet Secretary shall— (a) ensure that the appointees to the Council reflect the interests of all sections of the society; (b) ensure equal opportunities for persons with disabilities and other marginalised groups; and (c) ensure that not more than two-thirds of the members are of the same gender. (14) Every appointment made under this section shall be published in the Kenya Gazette . [Act No. 1 of 2009 , s. 34, Act No. 41A of 2013 , s. 2, Act No. 41A of 2013 , ss. 38 & 39.]"
    },
    {
      "provision_ref": "s104",
      "chapter": "Part VII",
      "section": "104",
      "title": "Prosecution of offences",
      "content": "(1) The Authority shall, pursuant to Article 157(12) of the Constitution, have the power to undertake prosecution of any offence under this Act. (2) An officer duly authorised in writing by the Authority may conduct a prosecution for any offence under this Act. [Act No. 41A of 2013 , s. 40.]"
    }
  ],
  "definitions": [
    {
      "term": "act of vandalism",
      "definition": "any willful, negligent, reckless or malicious act of stealing, destroying, damaging or breaking into telecommunications apparatus, lines, installations, hardware, software or plant used for telecommunication services and systems",
      "source_provision": "s2"
    },
    {
      "term": "advanced electronic signature",
      "definition": "an electronic signature which meets all the following requirements—",
      "source_provision": "s2"
    },
    {
      "term": "agreement",
      "definition": "decisions or practices",
      "source_provision": "s2"
    },
    {
      "term": "broadcaster",
      "definition": "any legal or natural person who composes or packages distributes television or radio programm services for reception by the public or sections of the public or subscribers to such a service, irrespective of technology used",
      "source_provision": "s2"
    },
    {
      "term": "broadcasting",
      "definition": "unidirectional conveyance of sounds or television programmes, whether encrypted or not by radio or other means of telecommunications, for reception by the public",
      "source_provision": "s2"
    },
    {
      "term": "broadcasting service",
      "definition": "any service which consists of the broadcasting of television or sound broadcasting programs to the public, sections of the public or subscribers to such a service",
      "source_provision": "s2"
    },
    {
      "term": "broadcasting signal distribution",
      "definition": "the process whereby the output signal of a broadcasting service is taken from the point of origin, being the point where such signal is made available in its final content format, from where it is conveyed to any broadcast target area by means of a telecommunication process and includes multi-channel distribution",
      "source_provision": "s2"
    },
    {
      "term": "Cabinet Secretary",
      "definition": "the Cabinet Secretary for the time being responsible for information, communication and technology",
      "source_provision": "s2"
    },
    {
      "term": "certificate",
      "definition": "a record which is issued by a certification service provider for the purpose of supporting a digital signature which purports to confirm the identity or other significant characteristics of the person who holds a particular key pair; identifies the certification service provider issuing it; names or identifies the person to whom it is issued; contains the public key of the person to whom it is issued; and is signed by a responsible officer of the certification service provider issuing it",
      "source_provision": "s2"
    },
    {
      "term": "certification service provider",
      "definition": "a person who has been granted a licence to issue a digital signature certificate",
      "source_provision": "s2"
    },
    {
      "term": "Commission",
      "definition": "the Communications Authority of Kenya",
      "source_provision": "s2"
    },
    {
      "term": "community",
      "definition": "a geographically founded community or any group of persons or sector of the public having a specific, ascertainable common interest",
      "source_provision": "s2"
    },
    {
      "term": "community broadcasting service",
      "definition": "a broadcasting service which meets all the following requirements—",
      "source_provision": "s2"
    },
    {
      "term": "computer",
      "definition": "any electronic, magnetic, optical or other high-speed data processing device or system which performs logical, arithmetic and memory functions by manipulations of electronic, magnetic or optical impulses, and includes all input, output, processing, storage, software and communication facilities which are connected or related as a system or network",
      "source_provision": "s2"
    },
    {
      "term": "computer service",
      "definition": "data processing and the storage or retrieval of data",
      "source_provision": "s2"
    },
    {
      "term": "computer system",
      "definition": "a device or collection of devices including input and output devices but excluding calculators which are not programmable and capable of being used in conjunction with external files which contain computer programmes, electronic instructions and data that perform logic, arithmetic, data storage, data retrieval, communication control and other functions",
      "source_provision": "s2"
    },
    {
      "term": "country code top-level domain",
      "definition": "top-level domain .ke used and reserved for Kenya",
      "source_provision": "s2"
    },
    {
      "term": "courier services",
      "definition": "any specialised service for the collection, despatch, conveyance, handling and delivery of postal articles",
      "source_provision": "s2"
    },
    {
      "term": "customs law",
      "definition": "any law relating to the collection of customs duties or transfer tax",
      "source_provision": "s2"
    },
    {
      "term": "cyber security",
      "definition": "the collection of tools, policies, security concepts, security safeguards, guidelines, risk management approaches, actions, training, best practices, assurance and technologies that can be used to protect the cyber environment",
      "source_provision": "s2"
    },
    {
      "term": "data",
      "definition": "information recorded in a format in which it can be processed by equipment operating automatically in response to instructions given for that purpose, and includes representations of facts, information and concepts held in any removable storage medium",
      "source_provision": "s2"
    },
    {
      "term": "document of title",
      "definition": "a formal document that is considered sufficient proof that the person who possesses it is entitled to receive, hold, and dispose of the instrument and the goods that it covers",
      "source_provision": "s2"
    },
    {
      "term": "e-Government services",
      "definition": "public services provided electronically by a Ministry or Government department, local authority, or any body established by or under any law or controlled or funded by the Government",
      "source_provision": "s2"
    },
    {
      "term": "electronic",
      "definition": "relating to technology having electrical, digital, magnetic, wireless, optical, electromagnetic, or similar capabilities",
      "source_provision": "s2"
    },
    {
      "term": "electronic record",
      "definition": "a record generated in digital form by an information system, which can be transmitted within an information system or from one information system to another and stored in an information system or other medium",
      "source_provision": "s2"
    },
    {
      "term": "electronic signature",
      "definition": "data in electronic form affixed to or logically associated with other electronic data which may be used to identify the signatory in relation to the data message and to indicate the signatory's approval of the information contained in the data message",
      "source_provision": "s2"
    },
    {
      "term": "encryption",
      "definition": "a method transforming signals in a systematic way so that the signal would be unintelligible without a suitable receiving apparatus",
      "source_provision": "s2"
    },
    {
      "term": "equipment",
      "definition": "any appliance, apparatus or accessory used or intended to be used for communication services",
      "source_provision": "s2"
    },
    {
      "term": "former Commission",
      "definition": "the Communications Commission of Kenya immediately existing before the commencement of this Act",
      "source_provision": "s2"
    },
    {
      "term": "free-to-air service",
      "definition": "a service which is broadcast without encryption and capable of being received by conventional broadcasting receiving apparatus",
      "source_provision": "s2"
    },
    {
      "term": "franking machine",
      "definition": "a machine for the purpose of making impressions on postal articles to denote pre-payment of postage and includes any meter or meters and any franking or date-stamping die incidental thereto",
      "source_provision": "s2"
    },
    {
      "term": "function",
      "definition": "logic, control, arithmetic, deletion, storage and retrieval and communication or telecommunication to from or within a computer system",
      "source_provision": "s2"
    },
    {
      "term": "information and communication technologies",
      "definition": "technologies employed in collecting, storing, using or sending out information and include those involving the use of computers or any telecommunication system",
      "source_provision": "s2"
    },
    {
      "term": "installation or plant used for posts",
      "definition": "all buildings, lands, structures, machinery, equipment, boxes and receptacles used or intended for use in connection with the transmission of postal articles by post",
      "source_provision": "s2"
    },
    {
      "term": "Kenyan programme",
      "definition": "sounds or vision or a combination of both whose content comply with the classification of local content as may be required by the Commission from time to time",
      "source_provision": "s2"
    },
    {
      "term": "letter",
      "definition": "any written or printed communication conveying from one person to another particular information upon matters personal to such persons or information upon which it is intended that the recipient should reply, act or refrain from acting, but does not include any written or printed communication which is a newspaper or a periodical accompanied by any other communication",
      "source_provision": "s2"
    },
    {
      "term": "licence",
      "definition": "any licence issued under this Act",
      "source_provision": "s2"
    },
    {
      "term": "mail bag",
      "definition": "any bag, container, envelope or covering in which postal articles are conveyed",
      "source_provision": "s2"
    },
    {
      "term": "market",
      "definition": "a market in Kenya or a substantial part of Kenya and refers to the range of reasonable possibilities for substitution in supply or demand between particular kinds of goods or services and between suppliers or acquirers, or potential suppliers or acquirers, of those goods or services",
      "source_provision": "s2"
    },
    {
      "term": "media",
      "definition": "broadcast, electronic and other types of media but does not include print and book publishing",
      "source_provision": "s2"
    },
    {
      "term": "modification",
      "definition": "a modification of the contents of any computer system by the operation of any function of that computer system or any other computer system as a result of which-",
      "source_provision": "s2"
    },
    {
      "term": "parcel",
      "definition": "a postal article which is posted at the office of a licensee as a parcel or is received at another office:",
      "source_provision": "s2"
    },
    {
      "term": "password",
      "definition": "any data by which a computer service or a computer system is capable of being obtained or used",
      "source_provision": "s2"
    },
    {
      "term": "post office",
      "definition": "any building, house, room, receptacle, vessel, vehicle or place where postal articles are received, delivered, sorted, made up or despatched",
      "source_provision": "s2"
    },
    {
      "term": "postage",
      "definition": "the fee chargeable for the transmission by post of postal articles",
      "source_provision": "s2"
    },
    {
      "term": "postage stamp",
      "definition": "any label or stamp for denoting any postage or other sum payable in respect of a postal article, and includes an adhesive postage stamp or a stamp printed, impressed or otherwise indicated on a postal article, whether issued by the Government of Kenya or any other country",
      "source_provision": "s2"
    },
    {
      "term": "postal article",
      "definition": "any article or thing transmissible by post, including but not limited to letters, aerogrammes, postcards and parcels but does include such article or thing as the Commission determines not to be transmissible by post",
      "source_provision": "s2"
    },
    {
      "term": "postal service",
      "definition": "any service by post",
      "source_provision": "s2"
    },
    {
      "term": "postcard",
      "definition": "a card recognised as a postcard in accordance with the terms of the Convention regulating the affairs of the Universal Postal Union",
      "source_provision": "s2"
    },
    {
      "term": "posting box",
      "definition": "any pillar box, wall box, any other box or receptacle provided by or under the authority of the public postal licensee for the purpose of receiving postal articles for transmission by or under the authority of the public postal licensee",
      "source_provision": "s2"
    },
    {
      "term": "private broadcaster",
      "definition": "a person licensed by the Commission under this Act to provide commercial broadcast services",
      "source_provision": "s2"
    },
    {
      "term": "private letter box/bag",
      "definition": "any receptacle whether identified by a distinctive number or not rented to a person for the receipt of postal articles and capable of being used whether the person or company renting it has his business premises open or not",
      "source_provision": "s2"
    },
    {
      "term": "programme",
      "definition": "sound, vision or a combination of both, intended to inform, educate or entertain, but does not include text or data",
      "source_provision": "s2"
    },
    {
      "term": "public broadcasting services",
      "definition": "broadcasting services of the public broadcaster",
      "source_provision": "s2"
    },
    {
      "term": "public postal licensee’s installation or plant",
      "definition": "any installation or plant used for postal purposes belonging to or used by the public postal licensee",
      "source_provision": "s2"
    },
    {
      "term": "radio communication",
      "definition": "the emitting or receiving over paths which are not provided by any material substance constructed or arranged for that purpose, of electro-magnetic energy of a frequency not exceeding three million megahertz being energy which either—",
      "source_provision": "s2"
    },
    {
      "term": "radio communication apparatus",
      "definition": "any apparatus capable of being used or adapted for radio communication and where the context so requires, includes a radio communication station",
      "source_provision": "s2"
    },
    {
      "term": "radio communication station",
      "definition": "any telecommunication station capable of being used or being adapted for radio communication",
      "source_provision": "s2"
    },
    {
      "term": "registration agent",
      "definition": "a person contracted or otherwise engaged by a telecommunications operator to carry out registration of SIM-cards",
      "source_provision": "s2"
    },
    {
      "term": "repository",
      "definition": "a system for storing and retrieving certificates or other information relevant to certificates",
      "source_provision": "s2"
    },
    {
      "term": "signatory",
      "definition": "a person who holds a signature-creation device and acts either on his own behalf or on behalf of the natural or legal person or entity he represents",
      "source_provision": "s2"
    },
    {
      "term": "signature-creation data",
      "definition": "unique data, such as codes or private cryptographic keys, which are used by the signatory to create an electronic signature",
      "source_provision": "s2"
    },
    {
      "term": "signature-creation device",
      "definition": "configured software or hardware used to implement the signature-creation data",
      "source_provision": "s2"
    },
    {
      "term": "significant market power",
      "definition": "a position of economic strength enjoyed by a licensee which enables it to prevent effective competition being maintained on the relevant market by affording it the power to behave independently of its competitors, customers and consumers",
      "source_provision": "s2"
    },
    {
      "term": "SIM-card",
      "definition": "the Subscriber Identity Module which is an independent electronically-activated device designed for use in conjunction with a telecommunication apparatus to enable the user of the telecommunication apparatus to transmit and receive indirect communications by providing access to telecommunication systems and enabling such telecommunication systems to identify the particular Subscriber Identity Module and its installed information",
      "source_provision": "s2"
    },
    {
      "term": "subscription management service",
      "definition": "a service which consists of the provision of support services to a subscription broadcasting service which support services may include, but not limited to, subscriber management support, subscription fee collection, call centres, sales and marketing, and technical and installation support",
      "source_provision": "s2"
    },
    {
      "term": "telecommunication apparatus",
      "definition": "apparatus constructed or adapted for use in transmitting anything which is transmissible by a telecommunication system, or in conveying anything which is transmitted through such a system",
      "source_provision": "s2"
    },
    {
      "term": "telecommunication line",
      "definition": "any wire, cable, tube, pipe or other similar thing which is designed or adapted for use in connection with the operation of a telecommunication system or a radio communication apparatus with any casing, coating, tube or pipe enclosing the same and any appliances and apparatus connected therewith for the same; and includes any structure, post or other thing in, by or from which any telecommunication and radio-communication apparatus is or may be installed, supported, carried or suspended",
      "source_provision": "s2"
    },
    {
      "term": "telecommunication service",
      "definition": "any of the following—",
      "source_provision": "s2"
    },
    {
      "term": "telecommunication system",
      "definition": "a system for the conveyance, through the agency of electric, magnetic, electro-magnetic, electro-chemical or electro-mechanical energy, of—",
      "source_provision": "s2"
    },
    {
      "term": "vandalize",
      "definition": "to commit an act of vandalism",
      "source_provision": "s2"
    },
    {
      "term": "vessel",
      "definition": "any ship, boat, air-cushioned vehicle or floating rig or platform used in navigation.",
      "source_provision": "s2"
    }
  ]
}